///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Определим имя объекта метаданных обработки
	ЧастиИмени = СтрРазделить(ЭтотОбъект.ИмяФормы, ".", Ложь);
	ИмяОбъекта = ЧастиИмени[0] + "." + ЧастиИмени[1];
	
	// Задаем параметры диаграмм PlantUML по умолчанию
	Объект.КомпактныйРежим           = Истина;
	Объект.ПрямыеСтрелки             = Истина;
	Объект.ВыводитьУсловияСоединения = Ложь;
	Объект.РасположитьСЛевоНаПраво   = Ложь;
	
	Объект.СворачиватьПромежуточныеУзлы = Истина;
	Объект.Физика                       = Истина;
	Объект.СдвигПакета                  = 500;
	Объект.СдвигУзла                    = 150;
	
	// Посмотрим что было передано при открытии формы
	Если ЭтотОбъект.Параметры.Свойство("ТекстЗапроса") Тогда
		ЭтотОбъект.ТекстЗапроса = ЭтотОбъект.Параметры.ТекстЗапроса;
	КонецЕсли;
	Если ЭтотОбъект.Параметры.Свойство("ВидДиаграммы") Тогда
		ЭтотОбъект.ВидДиаграммы = ЭтотОбъект.Параметры.ВидДиаграммы;
	КонецЕсли;
	
	// Производим инициализацию поля PlantUML
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ПолеСхемыPlantUML = ОбработкаОбъект.ПолучитьМакет("ШаблонПоляPlantUML").ПолучитьТекст();
	ЗаставкаPlantUML  = ОбработкаОбъект.ПолучитьМакет("ЗаставкаPlantUML");
	
	// Устанавливаем картинку заставки
	ЭтотОбъект.КартинкаSVG = ПолучитьСтрокуИзДвоичныхДанных(ЗаставкаPlantUML, КодировкаТекста.UTF8);
	
	// Заполним меню примеров
	ЗаполнитьПримерыТекстовЗапросов();
	
	ЗаписатьОперациюБизнесСтатистики("ОткрытиеФормы");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидДиаграммыПриИзменении(Неопределено);
	ПоказатьДанныеСхемы(Неопределено);
	ПодключитьОбработчикОжидания("ВывестиЗаставкуPlantUML", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ВидДиаграммыПриИзменении(Команда)
	
	Если Команда<>Неопределено Тогда
		ЭтоPlantUML(Команда=ЭтотОбъект.Команды.ВидДиаграммыPlantUML);
	КонецЕсли; 
	
	Если ЭтоPlantUML() Тогда
		Элементы.ГруппаДиаграмма.ТекущаяСтраница = Элементы.СтраницаСхемаPlantUML;
		Элементы.ВидДиаграммыPlantUML     .Пометка   = Истина;
		Элементы.ВидДиаграммыVISJS        .Пометка   = Ложь;
		Элементы.СохранитьКартинкуPlantUML.Видимость = Истина;
	Иначе
		Элементы.ГруппаДиаграмма.ТекущаяСтраница = Элементы.СтраницаСхемаVISJS;
		Элементы.ВидДиаграммыPlantUML     .Пометка   = Ложь;
		Элементы.ВидДиаграммыVISJS        .Пометка   = Истина;
		Элементы.СохранитьКартинкуPlantUML.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеСхемыVISJSПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ПросмотрПоУмолчанию 	= Элемент.Документ.DefaultView;
	
	ИмяСобытия 		= ПросмотрПоУмолчанию.EventName;
	ОписаниеСобытия	= ПросмотрПоУмолчанию.EventDescription;
	
	Если НЕ ЗначениеЗаполнено(ИмяСобытия) Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ДвойноеНажатие" И ЗначениеЗаполнено(ОписаниеСобытия) Тогда
		
		ОписаниеСобытияJSON = JSONВЗначение(ОписаниеСобытия);
		МассивУзлов = ОписаниеСобытияJSON.Получить("nodes");
		МассивРебер = ОписаниеСобытияJSON.Получить("edges");
		НавигационнаяСсылкаДляПерехода = "";
		
		Если ТипЗнч(МассивУзлов) = Тип("Массив") 
			И МассивУзлов.Количество() Тогда        //Считаем что нажали на узел
			ЭтоУзел = Истина;
			ИдентификаторЭлемента 	= МассивУзлов[0];
			ВывестиПолныйЗаголовокВОтдельномОкне(ПросмотрПоУмолчанию, ИдентификаторЭлемента, ЭтоУзел);
			
		ИначеЕсли ТипЗнч(МассивРебер) = Тип("Массив") 
			И МассивРебер.Количество() Тогда        //Считаем что нажали на ребро
			ЭтоУзел = Ложь;
			ИдентификаторЭлемента = МассивРебер[0];
			ВывестиПолныйЗаголовокВОтдельномОкне(ПросмотрПоУмолчанию, ИдентификаторЭлемента, ЭтоУзел);								
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НавигационнаяСсылкаДляПерехода) Тогда
			ПерейтиПоНавигационнойСсылке(НавигационнаяСсылкаДляПерехода);				
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия <> "Ошибка" Тогда
		ПросмотрПоУмолчанию.EventName = "";	
		ПросмотрПоУмолчанию.EventDescription = "";	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаЗапросПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Элементы.ОбновитьСТекущимиДанными.Доступность = НЕ ТекущаяСтраница.ТолькоПросмотр;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура СформироватьДиаграмму(Команда)
	
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	// Очищаем служебные данные
	ЭтотОбъект.ИзмененныйЗапрос = "";
	ЭтотОбъект.ТекстPlantUML    = "";
	ЭтотОбъект.ТекстJSON        = "";
	ЭтотОбъект.КартинкаSVG      = "";
	
	// Получение объектной модели SQL запроса выполняется асинхронно, выполним отдельно
	Если НЕ ЭтоТекстЗапроса1С() Тогда
		
		ЭтотОбъект.ТекстJSON = Ждать ПолучитьСхемуЗапросаSQL(ЭтотОбъект.ТекстЗапроса, Объект.ПутьКПитону, ЭтоPlantUML());
		Если ПустаяСтрока(ЭтотОбъект.ТекстJSON) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	// Производим построение 
	Если ЭтоPlantUML() Тогда
		СформироватьДиаграмму_PlantUML();
	Иначе
		СформироватьДиаграмму_VISJS();
	КонецЕсли;
	
КонецПроцедуры // СформироватьДиаграмму()

&НаКлиенте
Асинх Процедура СохранитьКартинкуPlantUML(Команда)
	
	Если ПустаяСтрока(ТекстЗапроса) ИЛИ НЕ ЗначениеЗаполнено(ЭтотОбъект.КартинкаSVG) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайла = СтрШаблон(НСтр("ru = 'Схема запроса %1.svg'"), Формат(ТекущаяДата(), "ДФ=yyyyMMddЧЧммсс"));
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок      = НСтр("ru = 'Выберите каталог для сохранения схемы запроса'");
	Диалог.ПолноеИмяФайла = ИмяФайла;
	Диалог.Фильтр         = НСтр("ru = 'Картинка (*.svg)'")+"|*.svg";
	
	Ответ = Ждать Диалог.ВыбратьАсинх();
	Если Ответ=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьТекстВФайл(Диалог.ПолноеИмяФайла, ЭтотОбъект.КартинкаSVG);
	
КонецПроцедуры // СохранитьКартинкуPlantUML()

&НаКлиенте
Процедура Настройки(Команда)
	
	ОткрытьФорму(ИмяОбъекта+".Форма.Настройки", Новый Структура("Объект", ЭтотОбъект.Объект), ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПримерНаСервере(ИмяМакета)
	
	ТекстЗапроса = РеквизитФормыВЗначение("Объект").ПолучитьМакет(ИмяМакета).ПолучитьТекст();
	ЗаписатьОперациюБизнесСтатистики("ЗагрузитьПример."+ИмяМакета);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПример(Команда)
	
	ЗагрузитьПримерНаСервере(Команда.Имя);
	СформироватьДиаграмму(Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДанныеСхемы(Команда)
	
	Если Команда<>Неопределено Тогда
		Объект.Отладка = НЕ Объект.Отладка;		
	КонецЕсли;
	
	Элементы.ПоказатьДанныеСхемы.Пометка = Объект.Отладка;
	
	Если Не Объект.Отладка Тогда
		Элементы.ГруппаЗапрос.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		Элементы.ГруппаЗапрос.ТекущаяСтраница    = Элементы.СтраницаТекстЗапроса;
	Иначе
		Элементы.ГруппаЗапрос.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	КонецЕсли;
	
	Страница = Элементы.ГруппаЗапрос.ТекущаяСтраница;
	Элементы.ОбновитьСТекущимиДанными.Доступность = НЕ(Страница.ТолькоПросмотр ИЛИ Страница=Элементы.СтраницаТекстЗапроса);
	Элементы.ОбновитьСТекущимиДанными.Видимость   = Объект.Отладка;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСТекущимиДанными(Команда)
	
	Страница = Элементы.ГруппаЗапрос.ТекущаяСтраница;
	Если Страница.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если Страница=Элементы.СтраницаPlantUML Тогда
		
		Если ПустаяСтрока(ЭтотОбъект.ТекстPlantUML) Тогда
			Возврат;
		КонецЕсли;
		
		ОбновитьКартинкуPlantUML();
		
		Документ = Элементы.ПолеСхемыPlantUML.Документ;
		Если Документ = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		// Получаем объект window
		ОкноHTML = Документ.defaultView;
		Если ОкноHTML = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		// Вызываем наш метод
		ОкноHTML.LoadSVG_as_TEXT(ЭтотОбъект.КартинкаSVG);
		
	ИначеЕсли Страница=Элементы.СтраницаVISJS Тогда
		Если ПустаяСтрока(ЭтотОбъект.ПолеСхемыVISJS) Тогда
			Возврат;
		КонецЕсли;
		ПодключитьОбработчикОжидания("Подключаемый_СформироватьДиаграмму_VISJS", 0.2, Истина);
		
	ИначеЕсли Страница=Элементы.СтраницаУзлыVISJS Тогда
		Если ПустаяСтрока(ЭтотОбъект.УзлыJS) Тогда
			Возврат;
		КонецЕсли;
		Подключаемый_СформироватьДиаграмму_VISJS();
		
	ИначеЕсли Страница=Элементы.СтраницаРебраVISJS Тогда
		Если ПустаяСтрока(ЭтотОбъект.РебраJS) Тогда
			Возврат;
		КонецЕсли;
		Подключаемый_СформироватьДиаграмму_VISJS();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура КонструкторЗапроса(Команда)
	
	ИмяРеквизитаЗапроса =
		?(ЭтотОбъект.ТекущийЭлемент = Элементы.ИзмененныйЗапрос, "ИзмененныйЗапрос", "ТекстЗапроса");
	
	Конструктор = Новый КонструкторЗапроса;
	Попытка
		Конструктор.Текст = ЭтотОбъект[ИмяРеквизитаЗапроса];
	Исключение
		ПоказатьМестоОшибкиЗапроса1С(ИнформацияОбОшибке(), Элементы.ТекстЗапроса);
		Возврат;
	КонецПопытки;
	
	Результат = Ждать Конструктор.ОткрытьАсинх();
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект[ИмяРеквизитаЗапроса] = Результат;
	
КонецПроцедуры // КонструкторЗапроса()

&НаКлиенте
Процедура ВывестиПолныйЗаголовокВОтдельномОкне(ПросмотрПоУмолчанию, ИдентификаторЭлемента, ЭтоУзел = Истина)
	
	Если ЭтоУзел Тогда
		ИмяЭлемента 	= ПросмотрПоУмолчанию.getNodeProperty(ИдентификаторЭлемента,"label");
		ПолныйЗаголовок = ПросмотрПоУмолчанию.getNodeProperty(ИдентификаторЭлемента,"fulltitle");
	Иначе
		
		ИмяУзла1 = ПросмотрПоУмолчанию.getNodeProperty(ПросмотрПоУмолчанию.getEdgeProperty(ИдентификаторЭлемента,"to"),"label");
		ИмяУзла2 = ПросмотрПоУмолчанию.getNodeProperty(ПросмотрПоУмолчанию.getEdgeProperty(ИдентификаторЭлемента,"from"),"label");
		
		ИмяЭлемента 	= СтрШаблон("Соединение узлов '%1' и '%2'", ИмяУзла1, ИмяУзла2);
		ПолныйЗаголовок = ПросмотрПоУмолчанию.getEdgeProperty(ИдентификаторЭлемента,"fulltitle");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПолныйЗаголовок) Тогда
		ПолныйЗаголовок = СтрЗаменить(ПолныйЗаголовок, "<br>", Символы.ПС);
		ОткрытьФорму(ИмяОбъекта+".Форма.ВыводЭлемента", Новый Структура("ТекстЗапроса,ИмяЭлемента", ПолныйЗаголовок, ИмяЭлемента));
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ОПрограмме(Команда)
	
	ИмяОбъектаМетаданных = СтрРазделить(ЭтотОбъект.ИмяФормы, ".", Ложь);
	ОткрытьФорму(ИмяОбъектаМетаданных[0] + "." + ИмяОбъектаМетаданных[1] + ".Форма.ОПрограмме",, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Общее

&НаСервереБезКонтекста
Процедура ЗаписатьОперациюБизнесСтатистики(ИмяОперации, Значение = 1, Комментарий = "")
	
	// Проверим, есть ли подсистема мониторинга
	Если Метаданные.ОбщиеМодули.Найти("ЦентрМониторинга") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// АПК:488-выкл Модуля может не быть в системе, обходим синтаксис контроль платформы
	МодульЦентрМониторинга = Вычислить("ЦентрМониторинга");
	// АПК:488-вкл
	
	УстановитьПривилегированныйРежим(ИСТИНА);
	Попытка
		ИмяОперации = "Инструменты.СхемаЗапроса1С." + ИмяОперации;
		МодульЦентрМониторинга.ЗаписатьОперациюБизнесСтатистики(ИмяОперации, Значение, Комментарий);
	Исключение
		Причина = ИнформацияОбОшибке();
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПримерыТекстовЗапросов()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ЗагрузитьПример = ЭтотОбъект.Команды["ЗагрузитьПример"];
	Элементы.ФормаЗагрузитьПример.Видимость = Ложь;
	
	Для каждого Макет Из ОбработкаОбъект.Метаданные().Макеты Цикл
		
		Если НЕ СтрНачинаетсяС(ВРег(Макет.Имя), ВРег("Пример")) Тогда
			Продолжить;
		КонецЕсли;
		
		Команда = ЭтотОбъект.Команды.Добавить(Макет.Имя);
		Команда.Заголовок = Макет.Синоним;
		Команда.Картинка = ЗагрузитьПример.Картинка;
		Команда.Действие = ЗагрузитьПример.Действие;
		
		Кнопка = Элементы.Добавить(Макет.Имя, Тип("КнопкаФормы"), Элементы.ГруппаПримеры);
		Кнопка.Заголовок  = Макет.Синоним;
		Кнопка.ИмяКоманды = Команда.Имя;
		Кнопка.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанели;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПримерыТекстовЗапросов()

&НаКлиенте
Функция ЭтоТекстЗапроса1С()
	
	// Пустое поле проще обработать как запрос 1С
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Производим идентификацию типа запроса по ключевым словам
	КлючевыеСлова = Новый Структура("ВЫБРАТЬ,SELECT,INSERT,UPDATE,DELETE,CREATE,DROP,RENAME,ALTER,GRANT,REVOKE,DENY,COMMIT,ROLLBACK,BEGIN", ИСТИНА);
	Для каждого Оператор Из КлючевыеСлова Цикл
		
		// Если найдено ключевое слово, то считаем что тип запроса определен
		Если СтрНайти(ВРег(ТекстЗапроса), Оператор.Ключ)<>0 Тогда
			Возврат (Оператор.Значение=ИСТИНА);
		КонецЕсли;
		
	КонецЦикла;
	
	// Ничего не нашли, предупредим пользователя
	ВызватьИсключение НСтр("ru = 'Ожидается выражение ""ВЫБРАТЬ""'");
	
КонецФункции

&НаКлиенте
Функция ЭтоPlantUML(УстановитьКакPlantUML=Неопределено)
	
	ВидPlantUML = 0;
	ВидVISJS    = 1;
	
	// Если находимся в режиме проверки, то возвращаем значение
	Если УстановитьКакPlantUML=Неопределено Тогда
	    Возврат (ВидДиаграммы=ВидPlantUML);
	КонецЕсли;
	
	// Производим установку значения режима
	ВидДиаграммы = ?(УстановитьКакPlantUML, ВидPlantUML, ВидVISJS);
	Возврат Неопределено;
	
КонецФункции // ЭтоPlantUML()

&НаКлиенте
Процедура ПоказатьМестоОшибкиЗапроса1С(Причина, Элемент)
	
	Сообщить(КраткоеПредставлениеОшибки(Причина), СтатусСообщения.Важное);
	Описание = Причина.Причина.Описание;
	
	НачалоБлока = СтрНайти(Описание, "{(");
	КонецБлока  = СтрНайти(Описание, ")}");
	
	ЧастиАдреса = СтрРазделить(Сред(Описание, НачалоБлока+2, КонецБлока-НачалоБлока-2), ",", ЛОЖЬ);
	Если ЧастиАдреса.Количество()=2 Тогда
		НачалоСтроки  = Число(ЧастиАдреса[0]);
		НачалоКолонки = Число(СокрЛП(ЧастиАдреса[1]));
		Элемент.УстановитьГраницыВыделения(НачалоСтроки, НачалоКолонки, НачалоСтроки, НачалоКолонки);
	КонецЕсли;
	
КонецПроцедуры // ПоказатьМестоОшибкиЗапроса1С()

&НаКлиенте
Процедура ВывестиЗаставкуPlantUML()
	
	Документ = Элементы.ПолеСхемыPlantUML.Документ;
	Если Документ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОкноHTML = Документ.defaultView;
	Если ОкноHTML = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОкноHTML.LoadSVG_as_TEXT(ЭтотОбъект.КартинкаSVG);
	
КонецПроцедуры // ВывестиЗаставкуPlantUML()

&НаСервере
Процедура ОбновитьКартинкуPlantUML()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.КартинкаSVG = ОбработкаОбъект.СформироватьДиаграммуНаСервисеPlantUML(ЭтотОбъект.ТекстPlantUML);
КонецПроцедуры

// Преобразует строку в формате JSON в значение при помощи метода глобального контекста ПрочитатьJSON.
// См. ограничения в синтакс-помощнике.
// Объекты JSON по умолчанию преобразует в значения типа Соответствие. 
// Имена свойств со значением типа Дата необходимо явно указывать, чтобы было выполнено преобразование.
// Ожидаемый формат дат - ISO (YYYY-MM-DDThh:mm:ssZ).
// 
// Параметры:
//   Строка - Строка - значение в формате JSON.
//   ИменаСвойствСоЗначениямиДата - Строка - имя свойства, содержащее значение типа Дата. Допустимо указывать несколько
//                                           свойств через запятую.
//                                - Массив из Строка 
//   ПрочитатьВСоответствие       - Булево - если Ложь, то объекты JSON будут преобразованы в значение типа Структура.
//   
// Возвращаемое значение:
//  Произвольный
//
&НаСервереБезКонтекста
Функция JSONВЗначение(Знач Строка, Знач ИменаСвойствСоЗначениямиДата = Неопределено, Знач ПрочитатьВСоответствие = Истина) Экспорт
	
	Если ТипЗнч(ИменаСвойствСоЗначениямиДата) = Тип("Строка") Тогда
		ИменаСвойствСоЗначениямиДата = СтрРазделить(ИменаСвойствСоЗначениямиДата, ", " + Символы.ПС, Ложь);
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	
	Возврат ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие, ИменаСвойствСоЗначениямиДата);
	
КонецФункции // JSONВЗначение()

#КонецОбласти

#Область PlantUML

&НаКлиенте
Функция СформироватьДиаграмму_PlantUML()
	
	Элементы.СохранитьКартинкуPlantUML.Доступность = ЛОЖЬ;
	
	Если ЭтоТекстЗапроса1С() Тогда
		Успешно = СформироватьДиаграмму_PlantUML_Запрос1С();
	Иначе
		Успешно = СформироватьДиаграмму_PlantUML_ЗапросSQL();
	КонецЕсли;
	
	// Проверим результат построения диаграммы
	Если НЕ Успешно Тогда
		Возврат Ложь;
	КонецЕсли;
	Элементы.СохранитьКартинкуPlantUML.Доступность = ИСТИНА;
	
	Документ = Элементы.ПолеСхемыPlantUML.Документ;
	Если Документ = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Получаем объект window
	ОкноHTML = Документ.defaultView;
	Если ОкноHTML = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Вызываем наш метод
	ОкноHTML.LoadSVG_as_TEXT(ЭтотОбъект.КартинкаSVG);
	Возврат Истина;
	
КонецФункции // СформироватьДиаграмму_PlantUML()

&НаСервере
Функция СформироватьДиаграмму_PlantUML_Запрос1С()
	
	ЗаписатьОперациюБизнесСтатистики("Формирование.PlantUML.Запрос1С", СтрЧислоСтрок(ЭтотОбъект.ТекстЗапроса));
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ИменаТаблиц  = Неопределено;
	СхемаЗапроса = ОбработкаОбъект.ПолучитьСхемуЗапроса1С(ЭтотОбъект.ТекстЗапроса, ЭтотОбъект.ИзмененныйЗапрос, ИменаТаблиц);
	
	ЭтотОбъект.ТекстPlantUML = ОбработкаОбъект.Сформировать_ТекстPlantUML_СхемаЗапроса1С(СхемаЗапроса, ИменаТаблиц);
	ЭтотОбъект.КартинкаSVG   = ОбработкаОбъект.СформироватьДиаграммуНаСервисеPlantUML(ЭтотОбъект.ТекстPlantUML);
	
	Возврат НЕ ПустаяСтрока(ЭтотОбъект.КартинкаSVG);
	
КонецФункции // СформироватьДиаграмму_PlantUML_Запрос1С()

&НаСервере
Функция СформироватьДиаграмму_PlantUML_ЗапросSQL()
	
	ЗаписатьОперациюБизнесСтатистики("Формирование.PlantUML.SQL", СтрЧислоСтрок(ЭтотОбъект.ТекстЗапроса));
	
	СхемаЗапросаSQL = JSONВЗначение(ЭтотОбъект.ТекстJSON);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ТекстPlantUML = ОбработкаОбъект.Сформировать_ТекстPlantUML_СхемаЗапросаSQL(СхемаЗапросаSQL);
	ЭтотОбъект.КартинкаSVG   = ОбработкаОбъект.СформироватьДиаграммуНаСервисеPlantUML(ЭтотОбъект.ТекстPlantUML);
	
	Возврат НЕ ПустаяСтрока(ЭтотОбъект.КартинкаSVG);
	
КонецФункции // СформироватьДиаграмму_PlantUML_ЗапросSQL()

#КонецОбласти

#Область VIS

&НаКлиенте
Функция СформироватьДиаграмму_VISJS()
	
	Если ЭтоТекстЗапроса1С() Тогда
		Успешно = СформироватьДиаграмму_VISJS_Запрос1С();
	Иначе
		Успешно = СформироватьДиаграмму_VISJS_ЗапросSQL();
	КонецЕсли;
	
	// Проверим результат построения диаграммы
	Если НЕ Успешно Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_СформироватьДиаграмму_VISJS", 0.2, Истина);
	Возврат Успешно;
	
КонецФункции // СформироватьДиаграмму_VISJS()

&НаСервере
Функция СформироватьДиаграмму_VISJS_Запрос1С()
	
	ЗаписатьОперациюБизнесСтатистики("Формирование.VISJS.Запрос1С", СтрЧислоСтрок(ЭтотОбъект.ТекстЗапроса));
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ИменаТаблиц  = Неопределено;
	СхемаЗапроса = ОбработкаОбъект.ПолучитьСхемуЗапроса1С(ЭтотОбъект.ТекстЗапроса, ЭтотОбъект.ИзмененныйЗапрос, ИменаТаблиц);
	
	СхемаЗапросаVIS = ОбработкаОбъект.Сформировать_СхемаЗапросаVIS_СхемаЗапроса1С(СхемаЗапроса, ИменаТаблиц);
	
	// Выводим в поле ТекстJSON данные полеченной объектной модели
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто));
	ЗаписатьJSON(ЗаписьJSON, СхемаЗапросаVIS);
	ЭтотОбъект.ТекстJSON = ЗаписьJSON.Закрыть();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.СформироватьДиаграммуVISJS(СхемаЗапросаVIS, УзлыJS, РебраJS, ПолеСхемыVISJS);
	
КонецФункции // СформироватьДиаграмму_VISJS_Запрос1С()

&НаСервере
Функция СформироватьДиаграмму_VISJS_ЗапросSQL()
	
	ЗаписатьОперациюБизнесСтатистики("Формирование.VISJS.SQL", СтрЧислоСтрок(ЭтотОбъект.ТекстЗапроса));
	
	Если ПустаяСтрока(ЭтотОбъект.ТекстJSON) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СхемаЗапросаVIS = JSONВЗначение(ЭтотОбъект.ТекстJSON);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.СформироватьДиаграммуVISJS(СхемаЗапросаVIS, УзлыJS, РебраJS, ПолеСхемыVISJS);
	
КонецФункции // СформироватьДиаграмму_VISJS_ЗапросSQL()

&НаКлиенте
Процедура Подключаемый_СформироватьДиаграмму_VISJS()
	
	Если Элементы.ПолеСхемыVISJS.Документ.defaultView.vis = Неопределено Тогда
		Сообщить(НСтр("ru = 'Ошибка в js коде'"));
		Возврат;
	КонецЕсли;
	
	Попытка
		Элементы.ПолеСхемыVISJS.Документ.defaultView.draw_query_diagram(УзлыJS, РебраJS);
	Исключение       
		Сообщить(НСтр("ru = 'Не удалось вызвать метод ''draw_query_diagram'': '") + ОписаниеОшибки());
	КонецПопытки;
	
	//Если Физика Тогда
	//	Итераций = 3*150;
	//	Попытка
	//		Элементы.ПолеСхемыVISJS.Документ.network.stabilize(Итераций);
	//		Элементы.ПолеСхемыVISJS.Документ.network.fit();
	//	Исключение
	//		Сообщить("Ошибка формирования HTML, не удалось вызвать метод стабилизации графа");
	//	КонецПопытки;
	//КонецЕсли;
	
КонецПроцедуры // Подключаемый_СформироватьДиаграмму_VISJS()

#КонецОбласти

#Область ПереводЗапросаSQLВJSON

// Сериализует текст SQL-запроса в формат JSON с помощью внешнего Python-скрипта.
// Выполняет распаковку необходимых скриптов, установку зависимостей через pip и запуск парсера.
//
// Параметры:
//  ТекстSQL      - Строка - Исходный текст SQL-запроса для обработки.
//  ПутьКПитону   - Строка - Полный путь к исполняемому файлу Python (python.exe).
//  РежимPlantUML - Булево - Настройки визуализации и парсинга: "vis" или "plant".
//
// Возвращаемое значение:
//  Строка - Результат сериализации в формате JSON. В случае ошибки возвращает пустую строку.
//
&НаКлиенте
Асинх Функция ПолучитьСхемуЗапросаSQL(ТекстSQL, ПутьКПитону, РежимPlantUML) Экспорт
	
	#Если ВебКлиент Тогда
	Сообщить(НСтр("ru = 'Построение диаграммы по SQL-запросу в веб-клиенте не поддерживается.'"));
	Возврат "";
	#КонецЕсли
	
	Состояние(НСтр("ru='Распаковка файлов сериализатора SQL-запросов'"), 0);
	
	// Пути к файлам.
	ПутьККаталогуСкриптов = СтрШаблон("%1%2", 
		Ждать КаталогВременныхФайловАсинх(),
		"sql_serialize"
	);
	ПутьКИсполняемомуСкрипту = СтрШаблон("%1%2%3%4%5", 
		ПутьККаталогуСкриптов,
		ПолучитьРазделительПути(),
		"sql_visualisation-master",
		ПолучитьРазделительПути(),
		"tree_sql_query.py"
	);
	
	// ПутьКИсполняемомуФайлу
	ИмяИсполняемогоФайла = "";
	Система = Новый СистемнаяИнформация;
	ЭтоWindowsКлиент = (Система.ТипПлатформы=ТипПлатформы.Windows_x86 ИЛИ Система.ТипПлатформы=ТипПлатформы.Windows_x86_64);
	ЭтоLinuxКлиент   = (Система.ТипПлатформы=ТипПлатформы.Linux_x86   ИЛИ Система.ТипПлатформы=ТипПлатформы.Linux_x86_64
							ИЛИ Система.ТипПлатформы=ТипПлатформы.Linux_ARM64 ИЛИ Система.ТипПлатформы=ТипПлатформы.Linux_E2K);
	Если ЭтоWindowsКлиент Тогда
		ИмяИсполняемогоФайла = "tree_sql_query_win_x64.exe";
	ИначеЕсли ЭтоLinuxКлиент Тогда
		ИмяИсполняемогоФайла = "tree_sql_query_linux_x64_glibc2.39";
	Иначе
		Сообщить(СтрШаблон(НСтр("ru = 'Построение диаграммы по SQL-запросу в операционной системе %1 не поддерживается.'"), Система.ТипПлатформы));
		Возврат "";
	КонецЕсли;
	ПутьКИсполняемомуФайлу = СтрШаблон("%1%2%3", 
		ПутьККаталогуСкриптов,
		ПолучитьРазделительПути(),
		ИмяИсполняемогоФайла
	);
	
	ИдентификаторФайла = Новый УникальныйИдентификатор;
	БазовоеИмяФайла = СтрШаблон("%1%2%3%4", 
		Ждать КаталогВременныхФайловАсинх(),
		"sql_serialize_", 
		ИдентификаторФайла
	);
	ПутьКФайлуЛога = СтрШаблон("%1.%2", БазовоеИмяФайла, "log");
	ПутьКФайлуSQL = СтрШаблон("%1.%2", БазовоеИмяФайла, "sql");
	ПутьКФайлуJSON = СтрШаблон("%1.%2", БазовоеИмяФайла, "json");
	ПутьКФайлуZIP = СтрШаблон("%1.%2", БазовоеИмяФайла, "zip");
	//ПутьКФайлуZIP = ПолучитьИмяВременногоФайла("zip");
	КаталогZIP = Ждать КаталогВременныхФайловАсинх();
	ИмяФайлаZIP = Строка(Новый УникальныйИдентификатор) + ".zip";
	ПутьКФайлуZIP = КаталогZIP + ИмяФайлаZIP;
	СписокУдалитьВКонце = Новый Массив;
	//СписокУдалитьВКонце.Добавить(ПутьККаталогуСкриптов);
	СписокУдалитьВКонце.Добавить(ПутьКФайлуZIP);
	СписокУдалитьВКонце.Добавить(ПутьКФайлуЛога);
	СписокУдалитьВКонце.Добавить(ПутьКФайлуSQL);
	СписокУдалитьВКонце.Добавить(ПутьКФайлуJSON);
	
	// Проверка версии скриптов, чтобы не выгружать заново.
	АктуальнаяВерсияСкриптов = АктуальнаяВерсияСкриптов();
	СтараяВерсияСкриптов = "-1";
	ПутьКФайлуСтаройВерсии = СтрШаблон("%1%2%3", 
		ПутьККаталогуСкриптов,
		ПолучитьРазделительПути(),
		"version.txt"
	);
	ФайлСтаройВерсии = Новый Файл(ПутьКФайлуСтаройВерсии);
	Если Ждать ФайлСтаройВерсии.СуществуетАсинх() Тогда
		СтараяВерсияСкриптов = СокрЛП(Ждать ПолучитьТекстФайла(ПутьКФайлуСтаройВерсии, КодировкаТекста.UTF8));
	КонецЕсли;
	Если АктуальнаяВерсияСкриптов <> СтараяВерсияСкриптов Тогда
		// Выгрузка скриптов.
		АрхивСкриптов = ПолучитьИзВременногоХранилища(ПолучитьАдресАрхиваСкриптов());
		АрхивСкриптов.Записать(ПутьКФайлуZIP);
		КаталогНаДиске = Новый Файл(ПутьККаталогуСкриптов);
		Если Ждать КаталогНаДиске.СуществуетАсинх() Тогда
			Ждать УдалитьФайлыАсинх(ПутьККаталогуСкриптов, "*.*");
		КонецЕсли;
		Ждать СоздатьКаталогАсинх(ПутьККаталогуСкриптов);
		Попытка
			Архив = Новый(Тип("ЧтениеФайлаАрхива"));
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Архив = Новый(Тип("ЧтениеZipФайла"));
		КонецПопытки;
		Попытка
			Архив.Открыть(ПутьКФайлуZIP);
			Архив.ИзвлечьВсе(ПутьККаталогуСкриптов);
			Архив.Закрыть();
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Сообщить(СтрШаблон("%1%2", 
				НСтр("ru = 'Ошибка при распаковке: '"),
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке)
			));
			Ждать УдалитьВременныеФайлы(СписокУдалитьВКонце);
			Возврат "";
		КонецПопытки;
	КонецЕсли;
	
	РезультатЗаписи = Ждать ЗаписатьТекстВФайл(ПутьКФайлуSQL, ТекстSQL);
	
	ВыходнойФормат = ?(РежимPlantUML, "plant", "vis");
	
	Если ЗначениеЗаполнено(ПутьКПитону) Тогда
	
		// Установка библиотек
		ПутьКТребованиямПитона = СтрШаблон("%1%2%3%4%5", 
			ПутьККаталогуСкриптов,
			ПолучитьРазделительПути(),
			"sql_visualisation-master",
			ПолучитьРазделительПути(),
			"requirements.txt"
		);
		СтрокаЗапуска = СтрШаблон("""%1"" -m pip install -r ""%2""",
			ПутьКПитону,
			ПутьКТребованиямПитона
		);
		Состояние(НСтр("ru='Установка необходимых библиотек python'"), 10);
		Если НЕ Ждать ЗапуститьПриложениеВывестиВФайл(СтрокаЗапуска, ПутьКФайлуЛога) Тогда
			Сообщить(СтрШаблон("%1%2", 
				НСтр("ru = 'Ошибка установки библиотек по причине: '"), 
				Ждать ПолучитьТекстФайла(ПутьКФайлуЛога)
			));
			УдалитьВременныеФайлы(СписокУдалитьВКонце);
			Возврат "";
		КонецЕсли;
		
		// Запуск скрипта python.
		ПараметрыПитона = Новый Массив;
		ПараметрыПитона.Добавить(ПутьКПитону);
		ПараметрыПитона.Добавить(ПутьКИсполняемомуСкрипту);
		ПараметрыПитона.Добавить(СтрШаблон("--input ""%1""", ПутьКФайлуSQL));
		ПараметрыПитона.Добавить(СтрШаблон("--output ""%1""", ПутьКФайлуJSON));
		ПараметрыПитона.Добавить(СтрШаблон("--format ""%1""", ВыходнойФормат));
		СтрокаЗапуска = СтрСоединить(ПараметрыПитона, " ");
		
	Иначе
		
		// Запуск скрипта из exe.
		ПараметрыЗапускаСкрипта = Новый Массив;
		ПараметрыЗапускаСкрипта.Добавить(ПутьКИсполняемомуФайлу);
		ПараметрыЗапускаСкрипта.Добавить(СтрШаблон("--input ""%1""", ПутьКФайлуSQL));
		ПараметрыЗапускаСкрипта.Добавить(СтрШаблон("--output ""%1""", ПутьКФайлуJSON));
		ПараметрыЗапускаСкрипта.Добавить(СтрШаблон("--format ""%1""", ВыходнойФормат));
		СтрокаЗапуска = СтрСоединить(ПараметрыЗапускаСкрипта, " ");
		
	КонецЕсли;
	
	Состояние(НСтр("ru='Запуск скрипта сериализатора SQL-запросов'"), 60);
	
	Если НЕ Ждать ЗапуститьПриложениеВывестиВФайл(СтрокаЗапуска, ПутьКФайлуЛога) Тогда
		Сообщить(СтрШаблон("%1%2", 
			НСтр("ru = 'Ошибка запуска скрипта по причине: '"),
			Ждать ПолучитьТекстФайла(ПутьКФайлуЛога, КодировкаТекста.ANSI)
		));
		Ждать УдалитьВременныеФайлы(СписокУдалитьВКонце);
		Возврат "";
	КонецЕсли;
	
	Состояние(НСтр("ru='Получение объектной модели SQL-запроса'"), 100);
	
	ТекстJSON = Ждать ПолучитьТекстФайла(ПутьКФайлуJSON);
	Ждать УдалитьВременныеФайлы(СписокУдалитьВКонце);
	Возврат ТекстJSON;
	
КонецФункции // ПолучитьСхемуЗапросаSQL()

// Функция - ЗапуститьПриложениеВывестиВФайл
//
// Параметры:
//  ТекстКоманды	 - 	 - Текст команды которую необходимо выполнить приложению
//  ПутьКФайлуВывода - 	 - Путь к файлу, в который будет произведен вывод стандартного выходного
// 
// Возвращаемое значение:
//   - Будево значение была ошибка или нет
//
&НаКлиенте
Асинх Функция ЗапуститьПриложениеВывестиВФайл(ТекстКоманды, ПутьКФайлуВывода)
	// Для того чтобы перенаправить выходной поток в файл, создадим bat файл и выполним его
	ИдентификаторФайла = Новый УникальныйИдентификатор;
	ПутьКБат = Ждать КаталогВременныхФайловАсинх() + "\sql_serialize_" + ИдентификаторФайла + ".bat";

	БатТекст = Новый ЗаписьТекста(ПутьКБат, КодировкаТекста.ANSI);
	БатТекст.Закрыть();
	БатТекст = Новый ЗаписьТекста(ПутьКБат, , , Истина, Символы.ПС);
	
	//БатТекст = Новый ЗаписьТекста;
	//БатТекст.Открыть(ПутьКБат, КодировкаТекста.ANSI);
	БатТекст.ЗаписатьСтроку("@chcp 65001"); // Первой строкой устанавливаем кодировку
	// Второй строкой устанавливаем текст команды, которую необходимо выполнить
	// 1> - Перенаправление стандартного выходного потока в файл ПутьКФайлуВывода
	// 2>&1 - Перенаправление стандартного потока ошибок в тот же файл
	БатТекст.ЗаписатьСтроку(ТекстКоманды + " 1> """ + ПутьКФайлуВывода + """ 2>&1");
	БатТекст.Закрыть();

	КодВозврата = Ждать ЗапуститьПриложениеАсинх(ПутьКБат, , Истина);
	Если КодВозврата = Неопределено Тогда
		КодВозврата = 1;
	КонецЕсли;
	
	// После исполнения команды удалим временный файл
	Ждать УдалитьФайлыАсинх(ПутьКБат);
	Возврат (КодВозврата < 1);
КонецФункции

&НаКлиенте
Асинх Функция ПолучитьТекстФайла(ПутьКФайлу, Кодировка = Неопределено)
	Если Кодировка = Неопределено Тогда
		Кодировка = КодировкаТекста.UTF8;
	КонецЕсли;
	ТекстовыйФайл = Новый ТекстовыйДокумент;
	Ждать ТекстовыйФайл.ПрочитатьАсинх(
		ПутьКФайлу,
		Кодировка
	);
	Возврат ТекстовыйФайл.ПолучитьТекст();
КонецФункции

&НаКлиенте
Асинх Функция ЗаписатьТекстВФайл(ПутьКФайлу, ТекстФайла)
	ТекстовыйФайл = Новый ТекстовыйДокумент;
	ТекстовыйФайл.УстановитьТекст(ТекстФайла);
	Ждать ТекстовыйФайл.ЗаписатьАсинх(
		ПутьКФайлу, 
		КодировкаТекста.UTF8
	);
	Возврат Истина;
КонецФункции

&НаКлиенте
Асинх Функция УдалитьВременныеФайлы(ВременныеФайлы)
	
	// Удаление временных файлов.
	Для каждого ФайлУдалить Из ВременныеФайлы Цикл
		ФайлОбъект = Новый Файл(ФайлУдалить);
		Если Ждать ФайлОбъект.СуществуетАсинх() Тогда
			Ждать УдалитьФайлыАсинх(ФайлУдалить);
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

&НаСервере
Функция ПолучитьАдресАрхиваСкриптов() Экспорт
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СкриптыСериализацииSQL");
	Возврат ПоместитьВоВременноеХранилище(Макет);
	
КонецФункции

&НаСервере
Функция АктуальнаяВерсияСкриптов() Экспорт
	
	Возврат РеквизитФормыВЗначение("Объект").Метаданные().Макеты.СкриптыСериализацииSQL.Комментарий;
	
КонецФункции

#КонецОбласти

#КонецОбласти
