///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВывестиСведенияОПрограмме();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтотОбъект.ТекущийЭлемент = Элементы.Логотип;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВывестиСведенияОПрограмме()
	
	СведенияОПрограмме = ПолучитьСведенияОПрограмме();
	Если ТипЗнч(СведенияОПрограмме)<>Тип("Структура") ИЛИ ПустаяСтрока(СведенияОПрограмме.Версия) Тогда
		ВызватьИсключение НСтр("ru = 'Нарушен формат указания сведений о программе. См. https://its.1c.ru/db/bsp311doc#content:31:hdoc'");
	КонецЕсли;
	
	Инструмент1СРарус = Неопределено;
	Если НЕ СведенияОПрограмме.Свойство("Инструмент1СРарус", Инструмент1СРарус) ИЛИ ТипЗнч(Инструмент1СРарус)<>Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru = 'Нарушен формат описания инструмента 1С-Рарус. См. функцию МодульОбъекта.СведенияОИнструменте1СРарус()'");
	КонецЕсли;
	
	Элементы.НазваниеПрограммы .Заголовок = Инструмент1СРарус.Синоним;
	Элементы.ВерсияПрограммы   .Заголовок = Инструмент1СРарус.Версия;
	Элементы.ОписаниеАдрес     .Заголовок = Новый ФорматированнаяСтрока(Инструмент1СРарус.Описание,,,,    Инструмент1СРарус.Описание);
	Элементы.РепозиторийПроекта.Заголовок = Новый ФорматированнаяСтрока(Инструмент1СРарус.Репозиторий,,,, Инструмент1СРарус.Репозиторий);
	
	Авторы = СтрРазделить(СтрЗаменить(Инструмент1СРарус.Авторы, ",", ";"), ";", ЛОЖЬ);
	Если Авторы.Количество() > 1 Тогда
		Элементы.НадписьАвторы.Заголовок = НСтр("ru = 'Авторы'");
	КонецЕсли;
	
	Для Сч=0 По Авторы.ВГраница() Цикл
		
		ИмяЭлемента = "Автор" + Формат(Сч, "ЧН=0; ЧГ=0");
		
		Элемент = Элементы.Найти(ИмяЭлемента);
		Если Элемент=Неопределено Тогда
			Элемент = ЭтотОбъект.Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), Элементы.ГруппаПереченьАвторов);
		КонецЕсли;
		
		Элемент.Заголовок = СокрЛП(Авторы[Сч]);
		
	КонецЦикла;
	
КонецПроцедуры // ВывестиСведенияОПрограмме()

&НаСервере
Функция ПолучитьСведенияОПрограмме()
	
	ИмяОбъекта = СтрРазделить(ЭтотОбъект.ИмяФормы, ".", ЛОЖЬ);
	Если ИмяОбъекта.Количество() < 3 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ВРег(ИмяОбъекта[0])=ВРег("ВнешняяОбработка") ИЛИ ВРег(ИмяОбъекта[0])=ВРег("ExternalDataProcessor") Тогда
		ТекущийОбъект = ВнешниеОбработки.Создать(ИмяОбъекта[1]);
		
	ИначеЕсли ВРег(ИмяОбъекта[0])=ВРег("ВнешнийОтчет") ИЛИ ВРег(ИмяОбъекта[0])=ВРег("ExternalReport") Тогда
		ТекущийОбъект = ВнешниеОтчеты.Создать(ИмяОбъекта[1]);
	ИначеЕсли ВРег(ИмяОбъекта[0]) = ВРег("Обработка") ИЛИ ВРег(ИмяОбъекта[0]) = ВРег("DataProcessor") Тогда
		ТекущийОбъект = Обработки[ИмяОбъекта[1]].Создать();
		
	ИначеЕсли ВРег(ИмяОбъекта[0]) = ВРег("Отчет") ИЛИ ВРег(ИмяОбъекта[0]) = ВРег("Report") Тогда
		ТекущийОбъект = Отчеты[ИмяОбъекта[1]].Создать();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		СведенияОПрограмме = ТекущийОбъект.СведенияОВнешнейОбработке();
		Возврат СведенияОПрограмме;
	Исключение
		ПричинаОшибки = ИнформацияОбОшибке();
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции // ПолучитьСведенияОПрограмме()

#КонецОбласти