///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает сведения о внешней обработке.
//
// Возвращаемое значение:
//   Структура - сведения о внешней обработке.
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	ОбъектМетаданных = ЭтотОбъект.Метаданные();
	
	ПараметрыРегистрации = Новый Структура;
	
	ПараметрыРегистрации.Вставить("Вид",          "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Версия",       "1.0.1.1");
	ПараметрыРегистрации.Вставить("Назначение",   Новый Массив);
	ПараметрыРегистрации.Вставить("Наименование", ОбъектМетаданных.Синоним);
	ПараметрыРегистрации.Вставить("Информация",   ОбъектМетаданных.Комментарий);
	ПараметрыРегистрации.Вставить("ВерсияБСП",    "3.1.5.110");
	
	ПараметрыРегистрации.Вставить("БезопасныйРежим",          Ложь);
	ПараметрыРегистрации.Вставить("ОпределитьНастройкиФормы", Ложь);
	
	ТаблицаКоманд = Новый ТаблицаЗначений;
	ТаблицаКоманд.Колонки.Добавить("Представление",        Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("Идентификатор",        Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("Использование",        Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	ТаблицаКоманд.Колонки.Добавить("Модификатор",          Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("Скрыть",               Новый ОписаниеТипов("Булево"));
	ТаблицаКоманд.Колонки.Добавить("ЗаменяемыеКоманды",    Новый ОписаниеТипов("Строка"));
	
	Команда = ТаблицаКоманд.Добавить();
	Команда.Представление = ОбъектМетаданных.Синоним;
	Команда.Использование = "ОткрытиеФормы";
	Команда.Идентификатор = ОбъектМетаданных.Имя;
	
	ПараметрыРегистрации.Вставить("Команды",    ТаблицаКоманд);
	ПараметрыРегистрации.Вставить("Разрешения", Новый Массив);
	
	ПараметрыРегистрации.Вставить("Авторы", НСтр("ru = 'Станислав Борисенко; Евгений Виноградов; Данил Кутов; Андрей Черанев; Дмитрий Чесноков; Антон Цюпцюн'"));
	ПараметрыРегистрации.Вставить("РепозиторийПроекта", "https://github.com/rarus/query-schema-1С");
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КорректировкаТекстаЗапроса1С

Функция ПолучитьСхемуЗапроса1С(ТекстЗапроса, ИзмененныйЗапрос, ИменаТаблиц) Экспорт
	
	СхемаЗапроса = Новый СхемаЗапроса;
	ИменаТаблиц  = Новый Соответствие();
	
	// Пробуем прочитать запрос как есть
	Попытка
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		ИзмененныйЗапрос = "";
		Возврат СхемаЗапроса;
	Исключение
		Причина = ИнформацияОбОшибке();
	КонецПопытки;
	
	// Производим подмену в запросе обращений к таблицам БД
	ИзмененныйЗапрос = КорректировкаТекстаЗапроса1С(ТекстЗапроса, ИменаТаблиц);
	
	Попытка
		СхемаЗапроса.УстановитьТекстЗапроса(ИзмененныйЗапрос);
	Исключение
		
		Причина = ИнформацияОбОшибке();
		
		ВызватьИсключение СтрШаблон(НСтр("ru = 'При разборе текста запроса возникла ошибка: %1'"),
			ОбработкаОшибок.КраткоеПредставлениеОшибки(Причина));
		
	КонецПопытки;
	
	Возврат СхемаЗапроса;
	
КонецФункции // ПолучитьСхемуЗапроса1С()

Функция КорректировкаТекстаЗапроса1С(Знач ТекстЗапроса, ИменаТаблиц=Неопределено, ВремяРаботы=0)
	
	// Важно! Если не задан пресвдоним таблиц, но есть обращение к полям, то такой запрос не будет читаться схемой
	
	//Ошибки:
	// - Декартово произведение
	//   * Как отличить поле от таблицы: Документ.Ссылка
	//   + Константы прощены
	
	ВремяНачало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ИзмененныйЗапрос = ТекстЗапроса;
	
	Если ИменаТаблиц=Неопределено Тогда
		ИменаТаблиц = Новый Соответствие();
	КонецЕсли;
	
	ШаблоныЗаменыЗапроса = Новый СписокЗначений();
	
	// Все строковые выражения в запросе заменяем на пустую строку
	ШаблоныЗаменыЗапроса.Добавить(СтрЗаменить("(?<!')'(?:[^']|'')++'", "'", """"), """""");
	
	// Убираем все комментарии из текста запроса
	ШаблоныЗаменыЗапроса.Добавить("\/\/.*$", "");
	
	// Исключаем директивы компоновщика данных
	//!!!ШаблоныЗаменыЗапроса.Добавить("\{[^{}]*\}", "");
	
	// Производим подмену операторов ССЫЛКА
	ШаблоныЗаменыЗапроса.Добавить("\b(?:ССЫЛКА|REF)\s+[A-ZА-Я0-9_]+(?:\.[A-ZА-Я0-9_]+)+", "ЕСТЬ NULL");
	
	// Производим замену вызова функции ТИП
	ШаблоныЗаменыЗапроса.Добавить("\b(?:ТИП)\s*\(\s*[A-ZА-Я0-9_]+(?:\.[A-ZА-Я0-9_]+)+\s*\)", "&__EXT__TYPE__");
	
	// Производим подмену всех операторов ЗНАЧЕНИЕ
	ШаблоныЗаменыЗапроса.Добавить("\b(?:ЗНАЧЕНИЕ|VALUE)\s*\([^()]*\)", "&__EXT__VALUE__");
	
	// Производим простую подмену опаратора ВЫРАЗИТЬ, которые обращаются к таблицам БД
	ШаблоныЗаменыЗапроса.Добавить("\b(?:ВЫРАЗИТЬ|CAST)++\s*\([^()]*\s+(?:КАК|AS)\s+[A-ZА-Я0-9_]+(?:\.[A-ZА-Я0-9_]+)+\s*\)", "&__EXT__CAST_A__");
	
	// Производим рекурсивную замену операторов ВЫРАЗИТь со вложениями
	ШаблоныЗаменыЗапроса.Добавить("\b(?:ВЫРАЗИТЬ|CAST)\s*\(.*\s+(?:КАК|AS)\s+[A-ZА-Я0-9_]+(?:\.[A-ZА-Я0-9_]+)+\s*\)", "&__EXT__CAST_B№__", ИСТИНА);
	//ШаблоныЗаменыЗапроса.Добавить("\b(?:КАК|AS)\s+[A-ZА-Я0-9_]+(?:\.[A-ZА-Я0-9_]+)+\s*(?=\))", "КАК СТРОКА(0)", ИСТИНА);
	//!!! Сделать рекурсивную замену всего первого блока ВЫРАЗИТЬ в котором встречается " КАК Имя.Таблицы)"
	
	// Поиск обращений к физическим таблицам БД
	ШаблоныЗаменыЗапроса.Добавить("\b(?<=ИЗ|FROM|СОЕДИНЕНИЕ|JOIN)\s+((?:"+ВсеКлассыТаблицБД()+")(?:\.[A-ZА-Я0-9_]+)++)(?!\s*\()", " __EXT__TABLE_№__", ИСТИНА);
	
	// Произведем подмену обращений к виртуальным таблицам с простыми параметрами
	ШаблоныЗаменыЗапроса.Добавить("\b((?:"+ВсеКлассыТаблицБД(ИСТИНА)+")(?:\.[A-ZА-Я0-9_]+)++)\s*(\([^()]*\))", "__EXT__VIRTUAL_A№__", ИСТИНА);
	
	// Производим поиск обращений к виртуальным таблицам со сложным содержимым в секции параметров
	ШаблоныЗаменыЗапроса.Добавить("\b((?:"+ВсеКлассыТаблицБД(ИСТИНА)+")(?:\.[A-ZА-Я0-9_]+)+)\s*\(", "__EXT__VIRTUAL_B№__", ИСТИНА);
	
	// Простим декартово произведение константам
	ШаблоныЗаменыЗапроса.Добавить("\b((?:КОНСТАНТА|CONSTANT)(?:\.[A-ZА-Я0-9_]+)++)(?!\s*\()", "__EXT__CONST_№__", ИСТИНА);
	
	//!!! Запрос на поиск и корректировку второй и последующих таблиц в декартовом произведении
	
	// Исправляем возникшие точки обращения к вложенным полям параметров
	ШаблоныЗаменыЗапроса.Добавить("&+[A-ZА-Я0-9_]+(?:\.[A-ZА-Я0-9_]+)+", "&__EXT__SUBPARAM__");
	
	// Финальный шаг: убираем обращения к вложенным полям таблиц более чем через 2 точки
	ШаблоныЗаменыЗапроса.Добавить("\b[A-ZА-Я0-9_]+(?:\.[A-ZА-Я0-9_]+){2,}(?:\s*\.\s*[*])?", "&__EXT__SUBFILD_A__", ИСТИНА);
	ШаблоныЗаменыЗапроса.Добавить("\b(?:[A-ZА-Я0-9_]+\.){2,}\s*\*",                         "&__EXT__SUBFILD_B__", ИСТИНА);
	
	// Выполняем последовательную корректировку текста запроса
	Для каждого Шаблон Из ШаблоныЗаменыЗапроса Цикл
		Если Шаблон.Пометка ИЛИ СтрНайти(Шаблон.Представление, "№") > 0 Тогда
			
			НачальнаяПозиция = 1;
			
			Пока ИСТИНА Цикл
				
				РезультатПоиска = СтрНайтиПоРегулярномуВыражению(ИзмененныйЗапрос, Шаблон.Значение,, НачальнаяПозиция,, ИСТИНА, ИСТИНА);
				Если РезультатПоиска.НачальнаяПозиция=0 Тогда
					Прервать;
				КонецЕсли;
				НачальнаяПозиция = РезультатПоиска.НачальнаяПозиция+1;
				
				ЕстьВложенныеБлоки = (Прав(СокрЛП(РезультатПоиска.Значение), 1)="(");
				ЕстьИмяТаблицы     = (РезультатПоиска.ПолучитьГруппы().Количество() > 0);
				
				ПредыдущийБлок  = Сред(ИзмененныйЗапрос, 1, РезультатПоиска.НачальнаяПозиция-1);
				НовыйБлок       = СтрЗаменить(Шаблон.Представление, "№", Формат(ИменаТаблиц.Количество()+1, "ЧН=0; ЧГ=0"));
				ТекущийБлок     = ?(ЕстьВложенныеБлоки, ПолучитьБлокЗапроса(ИзмененныйЗапрос, РезультатПоиска), РезультатПоиска.Значение);
				КонечнаяПозиция = РезультатПоиска.НачальнаяПозиция + СтрДлина(ТекущийБлок);
				
				ИмяТаблицы = ?(ЕстьИмяТаблицы, РезультатПоиска.ПолучитьГруппы()[0].Значение, ТекущийБлок);
				ИменаТаблиц.Вставить(СокрЛП(НовыйБлок), СокрЛП(ИмяТаблицы));
				
				Если ЕстьВложенныеБлоки И ЕстьИмяТаблицы Тогда
					БлокСоединений = ПеренестиВложенныеЗапросыКакСоединения(ИзмененныйЗапрос, ТекущийБлок, ИмяТаблицы, ИменаТаблиц);
					Если НЕ ПустаяСтрока(БлокСоединений) Тогда
						ПоискПсевдонима = СтрНайтиПоРегулярномуВыражению(ИзмененныйЗапрос, "\b(?:КАК|AS)\s+[A-ZА-Я0-9_]+",, КонечнаяПозиция,, ИСТИНА, ИСТИНА);
						Если ПустаяСтрока(Сред(ИзмененныйЗапрос, КонечнаяПозиция, ПоискПсевдонима.НачальнаяПозиция - КонечнаяПозиция)) Тогда
							НовыйБлок       = НовыйБлок + " " + ПоискПсевдонима.Значение + БлокСоединений;
							КонечнаяПозиция = ПоискПсевдонима.НачальнаяПозиция + ПоискПсевдонима.Длина;
						Иначе
							
							// Псевдоним можно синтезировать, но запрос не будет читаться схемой
							Псевдоним = СтрЗаменить(Сред(ИмяТаблицы, СтрНайти(ИмяТаблицы, ".")+1), ".", "");
							НовыйБлок       = НовыйБлок + " КАК " + Псевдоним + БлокСоединений;
							
							// Критическая ошибка: нет псевдонима у виртуальной таблицы с вложенным запросом
							//!!! ВызватьИсключение СтрШаблон(НСтр("ru = 'Виртуальная таблица %1 с вложенным запросом нет содержит псевдоним.'"), ИмяТаблицы);
							
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				ЧастиЗапроса = Новый Массив();
				ЧастиЗапроса.Добавить(ПредыдущийБлок);
				ЧастиЗапроса.Добавить(НовыйБлок);
				ЧастиЗапроса.Добавить(Сред(ИзмененныйЗапрос, КонечнаяПозиция));
				ИзмененныйЗапрос = СтрСоединить(ЧастиЗапроса);
				
			КонецЦикла;
			
			
		ИначеЕсли Шаблон.Пометка Тогда
			Пока СтрНайтиПоРегулярномуВыражению(ИзмененныйЗапрос, Шаблон.Значение, НаправлениеПоиска.СНачала, 1, 1, ИСТИНА, ИСТИНА).НачальнаяПозиция > 0 Цикл
				ИзмененныйЗапрос = СтрЗаменитьПоРегулярномуВыражению(ИзмененныйЗапрос, Шаблон.Значение, Шаблон.Представление, ИСТИНА, ИСТИНА);
			КонецЦикла;
			
		Иначе
			ИзмененныйЗапрос = СтрЗаменитьПоРегулярномуВыражению(ИзмененныйЗапрос, Шаблон.Значение, Шаблон.Представление, ИСТИНА, ИСТИНА);
		КонецЕсли;
	КонецЦикла;
	
	ВремяРаботы = ТекущаяУниверсальнаяДатаВМиллисекундах()-ВремяНачало;
	
	Возврат ИзмененныйЗапрос;
	
КонецФункции // КорректировкаТекстаЗапроса1С()

Функция ВсеКлассыТаблицБД(ТолькоВиртуальныеТаблицы=ЛОЖЬ)
	
	// Формируем коллекцию имен классов таблиц, котокрые можно использовать в запросе
	ТипыТаблицБД = Новый Массив();
	
	ТипыТаблицБД.Добавить("РегистрСведений");
	ТипыТаблицБД.Добавить("InformationRegister");
	
	ТипыТаблицБД.Добавить("РегистрНакопления");
	ТипыТаблицБД.Добавить("AccumulationRegister");
	
	ТипыТаблицБД.Добавить("РегистрБухгалтерии");
	ТипыТаблицБД.Добавить("AccountingRegister");
	
	ТипыТаблицБД.Добавить("РегистрРасчета");
	ТипыТаблицБД.Добавить("CalculationRegister");
	
	ТипыТаблицБД.Добавить("БизнесПроцесс");
	ТипыТаблицБД.Добавить("BusinessProcess");
	
	ТипыТаблицБД.Добавить("Задача");
	ТипыТаблицБД.Добавить("Task");
	
	ТипыТаблицБД.Добавить("КритерийОтбора");
	ТипыТаблицБД.Добавить("FilterCriterion");
	
	Если НЕ ТолькоВиртуальныеТаблицы Тогда
		
		ТипыТаблицБД.Добавить("ПланОбмена");
		ТипыТаблицБД.Добавить("ExchangePlan");
		
		ТипыТаблицБД.Добавить("Константы");
		ТипыТаблицБД.Добавить("Constants");
		
		ТипыТаблицБД.Добавить("Константа");
		ТипыТаблицБД.Добавить("Constant");
		
		ТипыТаблицБД.Добавить("Справочник");
		ТипыТаблицБД.Добавить("Catalog");
		
		ТипыТаблицБД.Добавить("Документ");
		ТипыТаблицБД.Добавить("Document");
		
		ТипыТаблицБД.Добавить("Последовательность");
		ТипыТаблицБД.Добавить("Sequence");
		
		ТипыТаблицБД.Добавить("ЖурналДокументов");
		ТипыТаблицБД.Добавить("DocumentJournal");
		
		ТипыТаблицБД.Добавить("Перечисление");
		ТипыТаблицБД.Добавить("Enum");
		
		ТипыТаблицБД.Добавить("ПланВидовХарактеристик");
		ТипыТаблицБД.Добавить("ChartOfCharacteristicTypes");
		
		ТипыТаблицБД.Добавить("ПланСчетов");
		ТипыТаблицБД.Добавить("ChartOfAccounts");
		
		ТипыТаблицБД.Добавить("ПланВидовРасчета");
		ТипыТаблицБД.Добавить("ChartOfCalculationTypes");
		
		ТипыТаблицБД.Добавить("ВнешнийИсточникДанных");
		ТипыТаблицБД.Добавить("ExternalDataSource");
		
	КонецЕсли;
	
	Возврат СтрСоединить(ТипыТаблицБД, "|");
	
КонецФункции // ВсеТипыТаблицБД()

Функция ПолучитьБлокЗапроса(ИзмененныйЗапрос, РезультатПоиска)
	
	Если Прав(СокрЛП(РезультатПоиска.Значение), 1)<>"(" Тогда
		Возврат РезультатПоиска.Значение;
	КонецЕсли;
	
	ТекущийБлок  = "";
	ОбщаяДлина   = СтрДлина(ИзмененныйЗапрос);
	СтатусСкобок = 1;
	
	// Найдем закрывающую скобку
	Для Индекс=РезультатПоиска.НачальнаяПозиция+РезультатПоиска.Длина По ОбщаяДлина Цикл
		
		ТекущийСимвол = Сред(ИзмененныйЗапрос, Индекс, 1);
		
		Если ТекущийСимвол="(" Тогда
			СтатусСкобок  = СтатусСкобок + 1;
		ИначеЕсли ТекущийСимвол=")" Тогда
			СтатусСкобок  = СтатусСкобок - 1;
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если СтатусСкобок<=0 Тогда
			ТекущийБлок = Сред(ИзмененныйЗапрос, РезультатПоиска.НачальнаяПозиция, Индекс - РезультатПоиска.НачальнаяПозиция + 1);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПустаяСтрока(ТекущийБлок) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = '{%1} Не найдена закрывающая скобка параметров временной таблицы: %2'"), РезультатПоиска.НачальнаяПозиция, СокрЛП(РезультатПоиска.Значение));
	КонецЕсли;
	
	Возврат ТекущийБлок;
	
КонецФункции // ПолучитьБлокЗапроса()

Функция ПеренестиВложенныеЗапросыКакСоединения(ИзмененныйЗапрос, ТекущийБлок, ИмяТаблицы, ИменаТаблиц)
	
	БлокСоединений = "";
	ШаблонЗамены   = "__EXT_FILTER_№___";
	
	Пока ИСТИНА Цикл
		
		ПоискВложенногоЗапроса = СтрНайтиПоРегулярномуВыражению(ТекущийБлок, "\((?=\s*(?:ВЫБРАТЬ|SELECT)\s+)",,,, ИСТИНА, ИСТИНА);
		Если ПоискВложенногоЗапроса.НачальнаяПозиция = 0 Тогда
			Возврат БлокСоединений;
		КонецЕсли;
		
		ВложенныйЗапрос = ПолучитьБлокЗапроса(ТекущийБлок, ПоискВложенногоЗапроса);
		НомерТаблицы    = Формат(ИменаТаблиц.Количество()+1, "ЧН=0; ЧГ=0");
		ИмяВложЗапроса  = СтрЗаменить(ШаблонЗамены, "№", НомерТаблицы);
		ИменаТаблиц.Вставить(ИмяВложЗапроса, ИмяТаблицы+".Отбор");//СокрЛП(ВложенныйЗапрос)
		
		БлокСоединений = БлокСоединений + Символы.ПС + "ВНУТРЕННЕЕ СОЕДИНЕНИЕ "+ВложенныйЗапрос+" КАК " + ИмяВложЗапроса + Символы.ПС+"ПО ИСТИНА";
		ТекущийБлок    = СтрЗаменить(ТекущийБлок, ВложенныйЗапрос, "(&"+ИмяВложЗапроса+")");
		
	КонецЦикла;
	
	Возврат БлокСоединений;
	
КонецФункции // ПеренестиВложенныеЗапросыКакСоединения()

#КонецОбласти

#Область ПостроениеPlantUML_Запрос1С

Функция Сформировать_ТекстPlantUML_СхемаЗапроса1С(СхемаЗапроса, ИменаТаблиц) Экспорт
	
	СписокТаблиц = Новый ТаблицаЗначений();
	СписокТаблиц.Колонки.Добавить("Имя");
	СписокТаблиц.Колонки.Добавить("Номер");
	СписокТаблиц.Колонки.Добавить("ЭтоВременнаяТаблица");
	СписокТаблиц.Колонки.Добавить("ПакетЗапроса");
	
	НомерЗапроса = 0;
	ШаблонНаименованияГруппы = НСтр("ru = 'Пакет запроса %1'");
	СоздаватьГруппы = СхемаЗапроса.ПакетЗапросов.Количество() > 1;
	
	ЧастиТекста = Новый Массив;
	ЧастиТекста.Добавить("@startuml");
	ЧастиТекста.Добавить(ПараметрыТекстаPlantUML());
	Если ЭтотОбъект.КомпактныйРежим Тогда
		ЧастиТекста.Добавить("together{");
	КонецЕсли;

	Для Каждого ПакетЗапроса Из СхемаЗапроса.ПакетЗапросов Цикл

		ИспользуемыеВременныеТаблицы = Новый Массив();
		НомерЗапроса = НомерЗапроса + 1;

		Если ТипЗнч(ПакетЗапроса) = Тип("ЗапросУничтоженияТаблицыСхемыЗапроса") Тогда

			Продолжить;

		КонецЕсли;

		Если Не ПустаяСтрока(ПакетЗапроса.ТаблицаДляПомещения) Тогда

			НазваниеГруппы = ПакетЗапроса.ТаблицаДляПомещения;
			//НаименованиеТаблицы = ПакетЗапроса.ТаблицаДляПомещения;
			НоваяСтрока = СписокТаблиц.Добавить();
			НоваяСтрока.Имя = НазваниеГруппы;
			НоваяСтрока.Номер = 0;
			НоваяСтрока.ЭтоВременнаяТаблица = Истина;

		Иначе

			НазваниеГруппы = СтрШаблон(ШаблонНаименованияГруппы, Формат(НомерЗапроса, "ЧГ=;"));

		КонецЕсли;

		СозданиеНовойГруппыПоТекстуЗапроса1С(
			ЧастиТекста,
			ПакетЗапроса,
			НазваниеГруппы,
			СписокТаблиц,
			СоздаватьГруппы,
			ИспользуемыеВременныеТаблицы,
			ИменаТаблиц);

		Если ЭтотОбъект.КомпактныйРежим Тогда

			Для Каждого ИспользуемаяВременнаяТаблица Из ИспользуемыеВременныеТаблицы Цикл

				ЧастиТекста.Добавить(СоединениеПакетовЗапроса(ИспользуемаяВременнаяТаблица, НазваниеГруппы));

			КонецЦикла;

		КонецЕсли;

	КонецЦикла;
	
	Если ЭтотОбъект.КомпактныйРежим Тогда
		ЧастиТекста.Добавить("}");
	КонецЕсли;
	ЧастиТекста.Добавить("@enduml");
	
	Возврат СтрСоединить(ЧастиТекста, Символы.ПС);
	
КонецФункции // Сформировать_ТекстPlantUML_СхемаЗапроса1С()

Функция ПараметрыТекстаPlantUML()
	
	НачалоТекста = 
	"hide empty members 
	|hide circle
	|skinparam class {
	|BackgroundColor White
	|  BorderColor Black
	|  FontSize 12
	|  Padding 10
	|  Margin 10
	|}
	|skinparam package {
	|  BorderColor Black
	|  FontSize 14
	|  FontStyle bold
	|  Padding 15
	|  Margin 10
	|} 
	|skinparam defaultTextAlignment center
	|set namespaceSeparator none
	|skinparam componentStyle rectangle";
	
	Если ЭтотОбъект.ПрямыеСтрелки Тогда
		НачалоТекста = НачалоТекста + "
			|skinparam linetype ortho";
	КонецЕсли;
	
	Возврат НачалоТекста;
	
КонецФункции // ПараметрыТекстаPlantUML()

Процедура СозданиеНовойГруппыПоТекстуЗапроса1С(
		ЧастиТекста,
		ПакетЗапроса,
		НазваниеГруппы,
		СписокТаблиц,
		СоздаватьГруппу,
		ИспользуемыеВременныеТаблицы,
		ИменаТаблиц,
		ПредставлениеТаблицы = "")

	СписокСоединений = ВидыСоединенияЗапроса1С();
	ЭтоВременнаяТаблица = СписокТаблиц.НайтиСтроки(Новый Структура("Имя", НазваниеГруппы)).Количество() > 0;
	ЭтоДобавление = Ложь;
	Попытка
		Если Не ПустаяСтрока(ПакетЗапроса.ТаблицаДляДобавления) Тогда
			ЭтоДобавление = СписокТаблиц.НайтиСтроки(
				Новый Структура("Имя,ЭтоВременнаяТаблица", ПакетЗапроса.ТаблицаДляДобавления, Истина)).Количество() > 0;
			Если ЭтоДобавление Тогда
				НазваниеГруппы = СтрЗаменить(НазваниеГруппы, " ", "");
			Иначе
				НазваниеГруппы = ПакетЗапроса.ТаблицаДляДобавления;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
	Если СоздаватьГруппу Тогда
		Если ЭтоДобавление Тогда
			ЧастиТекста.Добавить(СтрШаблон("package """" as %1 <<Rectangle>> #White {", НазваниеГруппы));
		ИначеЕсли Не ЭтоВременнаяТаблица И ПустаяСтрока(ПредставлениеТаблицы) Тогда
			ЧастиТекста.Добавить(СтрШаблон("package ""%1"" <<Frame>> #e9e8e4 {", НазваниеГруппы));
		Иначе
			Если ПустаяСтрока(ПредставлениеТаблицы) Тогда
				ЧастиТекста.Добавить(СтрШаблон("package ""%1"" <<Frame>> #White {", НазваниеГруппы));
			Иначе
				ЧастиТекста.Добавить(СтрШаблон("package ""%1"" as %2 <<Frame>> #White {", ПредставлениеТаблицы, НазваниеГруппы));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	СписокТаблицСвязями = Новый Массив();
	ТаблицыВыводаПакета = Новый Массив();

	ГруппироватьОбъединения = ПакетЗапроса.Операторы.Количество() > 1;
	СписокОбъединений = Новый ТаблицаЗначений();
	СписокОбъединений.Колонки.Добавить("ИмяГруппы");
	СписокОбъединений.Колонки.Добавить("ТипОбъединения");
	
	СписокСоединенийИсточника = Новый ТаблицаЗначений();
	СписокСоединенийИсточника.Колонки.Добавить("ИмяТаблицы");
	СписокСоединенийИсточника.Колонки.Добавить("ТипСоединения");
	СписокСоединенийИсточника.Колонки.Добавить("Условие");
	СписокСоединенийИсточника.Колонки.Добавить("НомерСтроки");
	
	Для Каждого Оператор Из ПакетЗапроса.Операторы Цикл

		Если ГруппироватьОбъединения Тогда
			НазваниеГруппыОбъединения = СтрШаблон(
			"Объединение%1%2", СтрЗаменить(НазваниеГруппы, " ", ""), Формат(СписокОбъединений.Количество() + 1, "ЧГ=0"));
			
			Если Оператор.ТипОбъединения = ТипОбъединенияСхемыЗапроса.Объединить Тогда
				ЗаголовокОбъединения = НСтр("ru = 'ОБЪЕДИНИТЬ РАЗЛИЧНЫЕ'");
			Иначе
				ЗаголовокОбъединения = НСтр("ru = 'ОБЪЕДИНИТЬ ВСЕ'");
			КонецЕсли;
			
			ЧастиТекста.Добавить(СтрШаблон("package ""%1"" as %2 <<Rectangle>> #White {", ЗаголовокОбъединения, НазваниеГруппыОбъединения));
			НоваяСтрока = СписокОбъединений.Добавить();
			НоваяСтрока.ИмяГруппы = НазваниеГруппыОбъединения;
			НоваяСтрока.ТипОбъединения = Оператор.ТипОбъединения;
			
		КонецЕсли;
		Для Каждого ТекущаяСтрокаТаблица Из СписокТаблиц Цикл
			
			ТекущаяСтрокаТаблица.Номер = ТекущаяСтрокаТаблица.Номер + 1;
			
		КонецЦикла;

		ПредыдущийИсточникТаблицы = "";
		СписокПсевдонимов = Новый Массив();
		Для Каждого ИсточникДанных Из Оператор.Источники Цикл

			Если ТипЗнч(ИсточникДанных.Источник) = Тип("ВложенныйЗапросСхемыЗапроса") Тогда

				ИмяТаблицыИсточникаОбъект = ИницализацияВложенногоЗапроса(
					ЧастиТекста, СписокТаблиц, ИсточникДанных, ИспользуемыеВременныеТаблицы, ИменаТаблиц, НазваниеГруппы);

			Иначе

				ИмяТаблицыИсточникаОбъект = ИмяТаблицыИсточникаДанныхЗапроса(
					ИсточникДанных.Источник.ИмяТаблицы,
					СписокТаблиц);
				Если ТаблицыВыводаПакета.Найти(ИмяТаблицыИсточникаОбъект) = Неопределено Тогда
					ТаблицыВыводаПакета.Добавить(ИмяТаблицыИсточникаОбъект);
					ЧастиТекста.Добавить(
						ИницализацияТаблицы(ИмяТаблицыИсточникаОбъект, ИсточникДанных.Источник.ИмяТаблицы, ИменаТаблиц));
					ДобавитьСвязьСВременнойТаблицей(
						ЧастиТекста,
						СписокТаблиц,
						ИмяТаблицыИсточникаОбъект,
						ИсточникДанных.Источник.ИмяТаблицы);
				КонецЕсли;
			
			КонецЕсли;

			СписокСоединенийИсточника.Очистить();
			Для Каждого Соединение Из ИсточникДанных.Соединения Цикл

				ЭтоВложенныйЗапрос = ТипЗнч(Соединение.Источник.Источник) = Тип("ВложенныйЗапросСхемыЗапроса");
				Если ЭтоВложенныйЗапрос Тогда
					ИмяТаблицыСоеднинения = ИницализацияВложенногоЗапроса(
						ЧастиТекста, СписокТаблиц, Соединение.Источник, ИспользуемыеВременныеТаблицы, ИменаТаблиц, НазваниеГруппы);
				Иначе
					ИмяТаблицыСоеднинения = ИмяТаблицыИсточникаДанныхЗапроса(
						Соединение.Источник.Источник.ИмяТаблицы,
						СписокТаблиц);
					Если ТаблицыВыводаПакета.Найти(ИмяТаблицыСоеднинения) = Неопределено Тогда
						ТаблицыВыводаПакета.Добавить(ИмяТаблицыСоеднинения);
						ЧастиТекста.Добавить(
							ИницализацияТаблицы(ИмяТаблицыСоеднинения, Соединение.Источник.Источник.ИмяТаблицы, ИменаТаблиц));
						ДобавитьСвязьСВременнойТаблицей(
							ЧастиТекста,
							СписокТаблиц,
							ИмяТаблицыСоеднинения,
							Соединение.Источник.Источник.ИмяТаблицы);
					КонецЕсли;
				КонецЕсли;
				
				СписокПсевдонимов.Добавить(Соединение.Источник.Источник.Псевдоним);
				
				НайденныеСоединения = СписокСоединенийИсточника.НайтиСтроки(
					Новый Структура("ИмяТаблицы,ТипСоединения", Соединение.Источник.Источник.Псевдоним, Соединение.ТипСоединения));
				
				Если НайденныеСоединения.Количество() > 0 Тогда
					НайденныеСоединения[0].Условие = СтрШаблон("%1\nИ %2", НайденныеСоединения[0].Условие, Строка(Соединение.Условие));
					Продолжить;
				КонецЕсли;
				
				Если СписокСоединенийИсточника.Количество() > 0
					И ЭтотОбъект.ВыводитьУсловияСоединения Тогда
					ПредыдущаяСвязь = СписокСоединенийИсточника[СписокСоединенийИсточника.Количество() - 1];
					ЧастиТекста.Вставить(
						ПредыдущаяСвязь.НомерСтроки,
						ОписаниеУсловияСвязи(ПредыдущаяСвязь.Условие));
				КонецЕсли;
				
				СоединениеСИточником = СписокСоединенийИсточника.Добавить();
				СоединениеСИточником.ИмяТаблицы = Соединение.Источник.Источник.Псевдоним;
				СоединениеСИточником.ТипСоединения = Соединение.ТипСоединения;
				СоединениеСИточником.Условие = Строка(Соединение.Условие);
				СоединениеСИточником.НомерСтроки = ЧастиТекста.Количество() + 1;
				
				ВидСоединения = СписокСоединений.Получить(Соединение.ТипСоединения);
				Если ВидСоединения = Неопределено Тогда
					ВидСоединения = "--";
				КонецЕсли;
				
				ЧастиТекста.Добавить(
					СоединениеТаблиц(ИмяТаблицыСоеднинения, ИмяТаблицыИсточникаОбъект, ВидСоединения));
				СписокТаблицСвязями.Добавить(ИмяТаблицыСоеднинения);
				
				Для Каждого ТекТаблицаВывода Из ТаблицыВыводаПакета Цикл
					Если ИмяТаблицыИсточникаОбъект = ТекТаблицаВывода Тогда
						Продолжить;
					КонецЕсли;
					ЧастиТекста.Добавить(
						СоединениеТаблицСкрыть(ТекТаблицаВывода, ИмяТаблицыСоеднинения));
					Прервать;
				КонецЦикла;

				Если СписокТаблиц.НайтиСтроки(
					Новый Структура("Имя,ЭтоВременнаяТаблица", ИмяТаблицыСоеднинения, Истина)).Количество() > 0
				Тогда
					ИспользуемыеВременныеТаблицы.Добавить(ИмяТаблицыСоеднинения);
				КонецЕсли;

			КонецЦикла;
			
			Если СписокСоединенийИсточника.Количество() > 0
				И ЭтотОбъект.ВыводитьУсловияСоединения Тогда
				ПредыдущаяСвязь = СписокСоединенийИсточника[СписокСоединенийИсточника.Количество() - 1];
				ЧастиТекста.Вставить(
					ПредыдущаяСвязь.НомерСтроки,
					ОписаниеУсловияСвязи(ПредыдущаяСвязь.Условие));
			КонецЕсли;
			
			ЭтоТаблицаИсточник = СписокПсевдонимов.Найти(ИсточникДанных.Источник.Псевдоним) = Неопределено;
			
			Если Не ПустаяСтрока(ПредыдущийИсточникТаблицы) И ЭтоТаблицаИсточник Тогда
				ЧастиТекста.Добавить(
					СоединениеТаблиц(
						ПредыдущийИсточникТаблицы, ИмяТаблицыИсточникаОбъект, СписокСоединений.Получить(ТипСоединенияСхемыЗапроса.Внутреннее)));
				ИсточникБезСоединения = "";
			КонецЕсли;
			
			Если ЭтоТаблицаИсточник Тогда
				ПредыдущийИсточникТаблицы = ИмяТаблицыИсточникаОбъект;
			КонецЕсли;
			
		КонецЦикла;

		Если ГруппироватьОбъединения Тогда
			Если Оператор.Источники.Количество() = 0 Тогда
				ИдентификаторКласса = Новый УникальныйИдентификатор();
				ЧастиТекста.Добавить(СтрШаблон("class %1", ИдентификаторКласса));
				ЧастиТекста.Добавить(СтрШаблон("hide %1", ИдентификаторКласса));
			КонецЕсли;
			Если СтрНачинаетсяС(ЧастиТекста[ЧастиТекста.ВГраница()], "package ") Тогда
				ЧастиТекста.Удалить(ЧастиТекста.ВГраница());
				СписокОбъединений.Удалить(СписокОбъединений[СписокОбъединений.Количество() - 1]);
				Продолжить;
			КонецЕсли;
			ЧастиТекста.Добавить("}");
		КонецЕсли;

	КонецЦикла;
	
	Если СоздаватьГруппу Тогда
		
		Если СтрЗаканчиваетсяНа(ЧастиТекста[ЧастиТекста.Вграница()], "{") Тогда
			ИдентификаторКласса = Новый УникальныйИдентификатор();
			ЧастиТекста.Добавить(СтрШаблон("class %1", ИдентификаторКласса));
			ЧастиТекста.Добавить(СтрШаблон("hide %1", ИдентификаторКласса));
		КонецЕсли;
		
		Если ЭтоДобавление Тогда
			ВидСоединения = СписокСоединений.Получить(ТипСоединенияСхемыЗапроса.ЛевоеВнешнее);
			ЧастиТекста.Добавить(
				СоединениеТаблиц(НазваниеГруппы, ПакетЗапроса.ТаблицаДляДобавления, ВидСоединения));
		КонецЕсли;
		
		ЧастиТекста.Добавить("}");
	КонецЕсли;

КонецПроцедуры

Функция ОписаниеУсловияСвязи(УсловиеСоединения)
	
	Если ПустаяСтрока(УсловиеСоединения) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат СтрШаблон("note right on link #white: %1", УсловиеСоединения);
	
КонецФункции

Процедура ДобавитьСвязьСВременнойТаблицей(ЧастиТекста, СписокТаблиц, ИмяТаблицыИсточникаОбъект, ИмяТаблицы)
	
	НайденныеСтроки = СписокТаблиц.НайтиСтроки(Новый Структура("Имя, ЭтоВременнаяТаблица", ИмяТаблицы, Истина));
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЧастиТекста.Добавить(СоединениеТаблицПакета(СтрШаблон("""%1""", ИмяТаблицы), ИмяТаблицыИсточникаОбъект));
	
КонецПроцедуры

Функция  ИницализацияВложенногоЗапроса(
		ЧастиТекста, СписокТаблиц, ИсточникДанных, ИспользуемыеВременныеТаблицы, ИменаТаблиц, ПакетЗапроса)
	
	Если ИменаТаблиц.Получить(ИсточникДанных.Источник.Псевдоним) <> Неопределено Тогда
		НаименованиеТаблицы = ИменаТаблиц.Получить(ИсточникДанных.Источник.Псевдоним);
	Иначе
		НаименованиеТаблицы = ИсточникДанных.Источник.Псевдоним;
	КонецЕсли;
	
	НайденныеВложенныеТаблицы = СписокТаблиц.НайтиСтроки(Новый Структура("Имя", ИсточникДанных.Источник.Псевдоним));
	Если НайденныеВложенныеТаблицы.Количество() > 0 Тогда
		Если НайденныеВложенныеТаблицы[0].ПакетЗапроса = ПакетЗапроса Тогда
			Возврат СтрШаблон("%1%2", ИсточникДанных.Источник.Псевдоним, СтрЗаменить(ПакетЗапроса, " ", ""));
		КонецЕсли;
		НайденныеВложенныеТаблицы[0].ПакетЗапроса = ПакетЗапроса;
		
	Иначе
		
		НоваяСтрока = СписокТаблиц.Добавить();
		НоваяСтрока.Имя = ИсточникДанных.Источник.Псевдоним;
		НоваяСтрока.Номер = 0;
		НоваяСтрока.ЭтоВременнаяТаблица = Истина;
		НоваяСтрока.ПакетЗапроса = ПакетЗапроса;
		
	КонецЕсли;
	
	ЧастиНаименования = СтрРазделить(НаименованиеТаблицы, ".");
	ПредставлениеОтбора = "Отбор";
	Если ЧастиНаименования.Количество() > 1
		И ЧастиНаименования[ЧастиНаименования.ВГраница()] = ПредставлениеОтбора Тогда
		НаименованиеТаблицы = ПредставлениеОтбора;
	КонецЕсли;
	
	ИдентификаторВложенного = СтрШаблон("%1%2", ИсточникДанных.Источник.Псевдоним, СтрЗаменить(ПакетЗапроса, " ", ""));
	
	СозданиеНовойГруппыПоТекстуЗапроса1С(
			ЧастиТекста,
			ИсточникДанных.Источник.Запрос,
			ИдентификаторВложенного,
			СписокТаблиц,
			Истина,
			ИспользуемыеВременныеТаблицы,
			ИменаТаблиц,
			НаименованиеТаблицы);
	Возврат ИдентификаторВложенного;

КонецФункции

Функция ИмяТаблицыИсточникаДанныхЗапроса(ИмяТаблицыИсточника, СписокТаблиц)
	
	СтрокиТаблиц = СписокТаблиц.НайтиСтроки(Новый Структура("Имя", ИмяТаблицыИсточника));

	Если СтрокиТаблиц.Количество() = 0 Тогда
	
		СтрокаТаблицы = СписокТаблиц.Добавить();
		СтрокаТаблицы.Имя = ИмяТаблицыИсточника;
		СтрокаТаблицы.Номер = 0;
		СтрокаТаблицы.ЭтоВременнаяТаблица = Ложь;

	Иначе

		СтрокаТаблицы = СтрокиТаблиц[0];

	КонецЕсли;
	
	ИмяТаблицыДанных = СтрШаблон("%1%2", ИмяТаблицыЗапросаПредставления(СтрокаТаблицы.Имя), СтрокаТаблицы.Номер);

	Возврат ИмяТаблицыДанных;

КонецФункции

Функция СоединениеТаблицПакета(Источник, Приемник)
	Возврат СтрШаблон("%1-%2[bold]->%3", Источник, НаправлениеСвязейИзИсточника(), Приемник);
КонецФункции

Функция СоединениеТаблиц(Источник, Приемник, ТипСоединения = "")
	
	Если ПустаяСтрока(ТипСоединения) Тогда
		ТипСоединения = СтрШаблон("-%1[dashed]-", НаправлениеСвязейИзИсточника());
	КонецЕсли;
	
	Возврат СтрШаблон("%1 %2 %3", Источник, ТипСоединения, Приемник);
	
КонецФункции

Функция СоединениеТаблицСкрыть(Источник, Приемник)
	Возврат СтрШаблон("%1 -[hidden]- %2", Источник, Приемник);
КонецФункции

Функция СоединениеПакетовЗапроса(Источник, Приемник)
	
	Возврат СтрШаблон(
		"%1-%2[hidden]-> %3",
		СтрШаблон("""%1""", Источник),
		НаправлениеСвязейИзИсточника(),
		СтрШаблон("""%1""", Приемник));
	
КонецФункции

Функция ИмяТаблицы(НаименованиеТаблицы) //!!! Нет ссылок на функцию
	Возврат СтрЗаменить(СокрЛП(НаименованиеТаблицы), " ", "");
КонецФункции

Функция ИницализацияТаблицы(ИмяТаблицы, Знач НаименованиеТаблицы, ИменаТаблиц)
	
	Если СтрНайти(НаименованиеТаблицы, ".") = 0
		И Не СтрНачинаетсяС(НаименованиеТаблицы, "&")
		И ИменаТаблиц.Получить(НаименованиеТаблицы) <> Неопределено Тогда
		НаименованиеТаблицы = ИменаТаблиц.Получить(НаименованиеТаблицы);
	КонецЕсли;
	
	Если СтрНайти(НаименованиеТаблицы, ".") > 0 Тогда
		Возврат СтрШаблон("class ""%1"" as %2 #FFFACD", "\n" + НаименованиеТаблицы + "\n", ИмяТаблицы);
	Иначе
		Возврат СтрШаблон("class ""%1"" as %2", "\n" + НаименованиеТаблицы + "\n", ИмяТаблицы);
	КонецЕсли;
КонецФункции

Функция ВидыСоединенияЗапроса1С()
	
	НаправлениеСвязей = "up";
	
	ВидыСоединений = Новый Соответствие();
	ВидыСоединений.Вставить(ТипСоединенияСхемыЗапроса.Внутреннее, СтрШаблон("o-%1[dashed]-o", НаправлениеСвязей));
	ВидыСоединений.Вставить(ТипСоединенияСхемыЗапроса.ЛевоеВнешнее, СтрШаблон("o-%1[dashed]-*", НаправлениеСвязей));
	ВидыСоединений.Вставить(ТипСоединенияСхемыЗапроса.ПолноеВнешнее, СтрШаблон("*-%1[dashed]-*", НаправлениеСвязей));
	ВидыСоединений.Вставить(ТипСоединенияСхемыЗапроса.ПравоеВнешнее, СтрШаблон("*-%1[dashed]-o", НаправлениеСвязей));
	
	Возврат ВидыСоединений;
	
КонецФункции

Функция НаправлениеСвязейИзИсточника()
	
	Если ЭтотОбъект.РасположитьСЛевоНаПраво Тогда
		Возврат "r";
	КонецЕсли;
	
	Возврат "up";
	
КонецФункции

Функция ИмяТаблицыЗапросаПредставления(ИмяТаблицы)

	Возврат СтрЗаменить(ИмяТаблицы, ".", "");

КонецФункции

#КонецОбласти

#Область ПостроениеPlantUML_ЗапросSQL

Функция Сформировать_ТекстPlantUML_СхемаЗапросаSQL(СхемаЗапроса) Экспорт
	
	Если ТипЗнч(СхемаЗапроса) = Тип("Массив") Тогда
		Если СхемаЗапроса.Количество() = 0 Тогда
			Возврат "";
		КонецЕсли;
		СхемаЗапроса = СхемаЗапроса[0];
	КонецЕсли;
	
	ПакетыЗапроса = СхемаЗапроса.Получить("tables");
	Если ПакетыЗапроса = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	СоздаватьГруппы = ПакетыЗапроса.Количество() > 1;
	ЧастиТекста = Новый Массив;
	ЧастиТекста.Добавить("@startuml");
	ЧастиТекста.Добавить(ПараметрыТекстаPlantUML());
	Если ЭтотОбъект.КомпактныйРежим Тогда
		ЧастиТекста.Добавить("together{");
	КонецЕсли;

	Для Каждого ПакетЗапроса Из ПакетыЗапроса Цикл

		СозданиеНовойГруппыПоТекстуЗапросаJSON(
			ЧастиТекста,
			ПакетЗапроса,
			СоздаватьГруппы,
			Истина);

	КонецЦикла;
	
	СвязиТаблиц = СхемаЗапроса.Получить("relations");
	ДополнитьСвязямиТекстЗапросаSQL(ЧастиТекста, СвязиТаблиц);
	
	Если ЭтотОбъект.КомпактныйРежим Тогда
		ЧастиТекста.Добавить("}");
	КонецЕсли;
	ЧастиТекста.Добавить("@enduml");
	
	Возврат СтрСоединить(ЧастиТекста, Символы.ПС);
	
КонецФункции // Сформировать_ТекстPlantUML_СхемаЗапросаSQL()

Процедура СозданиеНовойГруппыПоТекстуЗапросаJSON(
		ЧастиТекста,
		ПакетЗапроса,
		СоздаватьГруппу = Истина,
		ПервыйУровень = Ложь)

	ЭтоВременнаяТаблица = ВРег(ПакетЗапроса.Получить("type")) = ТипВременнойТаблицыJSON();
	ЭтоВложенныйЗапрос = ВРег(ПакетЗапроса.Получить("type")) = ТипВложенногоЗапросаJSON();
	ЭтоИсточникДанных = ВРег(ПакетЗапроса.Получить("type")) = ТипИсточникаДанныхJSON();
	ЭтоОбъединить = ВРег(ПакетЗапроса.Получить("type")) = ТипОбъедитьJSON();
	ЭтоОбъединитьВсе = ВРег(ПакетЗапроса.Получить("type")) = ТипОбъедитьВсеJSON()
		ИЛИ ВРег(ПакетЗапроса.Получить("type")) = ТипОбъедитьВсе2JSON();
	ЭтоЗапрос = ВРег(ПакетЗапроса.Получить("type")) = ТипВыборкиJSON();
	ЭтоГруппа = Ложь;
	
	Если ПервыйУровень Тогда
		Если ЭтоВременнаяТаблица Тогда
			ЧастиТекста.Добавить(
				СтрШаблон("package ""%1"" as %2 <<Frame>> #White {",
				ПакетЗапроса.Получить("name"),
				ПакетЗапроса.Получить("id")));
			ЭтоГруппа = Истина;
		ИначеЕсли СоздаватьГруппу Тогда
			ЧастиТекста.Добавить(
			СтрШаблон("package ""%1"" as %2 <<Frame>> #e9e8e4 {",
				ПакетЗапроса.Получить("name"),
				ПакетЗапроса.Получить("id")));
			ЭтоГруппа = Истина;
		КонецЕсли;
	ИначеЕсли ЭтоВременнаяТаблица ИЛИ ЭтоВложенныйЗапрос Тогда
		ЧастиТекста.Добавить(
			СтрШаблон("package ""%1"" as %2 <<Frame>> #White {",
			ПакетЗапроса.Получить("name"),
			ПакетЗапроса.Получить("id")));
		ЭтоГруппа = Истина;
	ИначеЕсли ЭтоОбъединить ИЛИ ЭтоОбъединитьВсе Тогда
		ЧастиТекста.Добавить(
			СтрШаблон("package ""%1"" as %2 <<<Rectangle>> #White {",
			ПакетЗапроса.Получить("name"),
			ПакетЗапроса.Получить("id")));
		ЭтоГруппа = Истина;
	ИначеЕсли ЭтоИсточникДанных Тогда
		ЧастиТекста.Добавить(СтрШаблон("class ""%1"" as %2 #FFFACD",
			"\n" + ПакетЗапроса.Получить("name") + "\n", ПакетЗапроса.Получить("id")));
	Иначе
		ЧастиТекста.Добавить(СтрШаблон("class ""%1"" as %2",
			"\n" + ПакетЗапроса.Получить("name") + "\n", ПакетЗапроса.Получить("id")));
	КонецЕсли;

	ТаблицыПакетаЗапроса = ПакетЗапроса.Получить("tables");
	Для Каждого ТаблицаПакета Из ТаблицыПакетаЗапроса Цикл
	
		СозданиеНовойГруппыПоТекстуЗапросаJSON(
			ЧастиТекста,
			ТаблицаПакета);
	
	КонецЦикла;
	
	Если ЭтоГруппа Тогда
		
		Если ТаблицыПакетаЗапроса.Количество() = 0 Тогда
			ИдентификаторКласса = Новый УникальныйИдентификатор();
			ЧастиТекста.Добавить(СтрШаблон("class %1", ИдентификаторКласса));
			ЧастиТекста.Добавить(СтрШаблон("hide %1", ИдентификаторКласса));
		КонецЕсли;
		
		ЧастиТекста.Добавить("}");
	КонецЕсли;

КонецПроцедуры

Процедура ДополнитьСвязямиТекстЗапросаSQL(ЧастиТекста, Связи)
	
	Если Связи = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СвязьМеждуВременнойТаблицей = СвязьВременнойТаблицыSQL();
	СписокСоединений = ВидыСоединенияЗапросаSQL();
	
	Для Каждого Связь Из Связи Цикл
		
		ВидСвязи = ВРег(Связь.Получить("type"));
		
		Если ВидСвязи = СвязьМеждуВременнойТаблицей Тогда
			ЧастиТекста.Добавить(СоединениеТаблицПакета(
				Связь.Получить("target_id"), Связь.Получить("source_id")));
		Иначе
			ВидСоединения = СписокСоединений.Получить(ВидСвязи);
			ЧастиТекста.Добавить(
				СоединениеТаблиц(
					Связь.Получить("source_id"),
					Связь.Получить("target_id"),
					ВидСоединения));
			Если ЭтотОбъект.ВыводитьУсловияСоединения Тогда
				ЧастиТекста.Добавить(ОписаниеУсловияСвязи(Связь.Получить("sql")));
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СвязьВременнойТаблицыSQL()
	
	Возврат "SELECT";
	
КонецФункции

Функция ВидыСоединенияЗапросаSQL()
	
	НаправлениеСвязей = "up";
	
	ВидыСоединений = Новый Соответствие();
	ВидыСоединений.Вставить("INNER_JOIN", СтрШаблон("o-%1[dashed]-o", НаправлениеСвязей));
	ВидыСоединений.Вставить("LEFT_JOIN", СтрШаблон("o-%1[dashed]-*", НаправлениеСвязей));
	ВидыСоединений.Вставить("FULL_JOIN", СтрШаблон("*-%1[dashed]-*", НаправлениеСвязей));
	ВидыСоединений.Вставить("RIGHT_JOIN", СтрШаблон("*-%1[dashed]-o", НаправлениеСвязей));
	ВидыСоединений.Вставить("CORRELATED_SUBQUERY", СтрШаблон("o-%1[dashed]-o", НаправлениеСвязей));
	ВидыСоединений.Вставить("LEFT_OUTER_JOIN", СтрШаблон("o-%1[dashed]-*", НаправлениеСвязей));
	
	Возврат ВидыСоединений;
	
КонецФункции

Функция ТипВременнойТаблицыJSON()
	
	Возврат "INSERT";
	
КонецФункции

Функция ТипВложенногоЗапросаJSON()
	
	Возврат "SUBQUERY";
	
КонецФункции

Функция ТипИсточникаДанныхJSON()
	
	Возврат "TABLE";
	
КонецФункции

Функция ТипОбъедитьВсеJSON()
	
	Возврат "UNION ALL";
	
КонецФункции

Функция ТипОбъедитьВсе2JSON()
	
	Возврат "UNION_ALL";
	
КонецФункции

Функция ТипОбъедитьJSON()
	
	Возврат "UNION";
	
КонецФункции

Функция ТипВыборкиJSON()
	
	Возврат "SELECT";
	
КонецФункции

#КонецОбласти

#Область ВызовСервисаPlantUML

Функция СформироватьДиаграммуНаСервисеPlantUML(ТекстPlantUML) Экспорт
	
	Если ПустаяСтрока(ТекстPlantUML) Тогда
		Возврат "";
	КонецЕсли;
	
	// На сервере PlantUML должны быть резрешены POST запросы и увеличены лимиты
	СерверPlantUML = "plantuml.rarus.ru";
	
	Попытка
		Если БезопасныйРежим() Тогда
			УстановитьБезопасныйРежим(ЛОЖЬ);
		КонецЕсли;
	Исключение
		ТекстСообщения = НСтр("ru = 'Установлен безопасный режим. Вызов внешнего сервиса PlantUML заблокирован. Используйте режим VIS.JS.'");
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=utf-8");
	
	Запрос = Новый HTTPЗапрос("/plantuml/svg/", Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТекстPlantUML, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Соединение = Новый HTTPСоединение(СерверPlantUML, 80,,,, 600);
	
	Попытка
		
		Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
		
	Исключение
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'При формировании изображения диаграммы на сервере %1 возникала ошибка:%2%3'"),
			СерверPlantUML,
			Символы.ПС,
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстСообщения;
		
	КонецПопытки;

	Если Ответ.КодСостояния < 200 ИЛИ Ответ.КодСостояния > 299 Тогда

		ТекстСообщения = СтрШаблон(НСтр("ru = 'При формировании изображения диаграммы на сервере %1 возникала ошибка:%2%3'"),
			СерверPlantUML,
			Символы.ПС,
			Ответ.ПолучитьТелоКакСтроку());
		ВызватьИсключение ТекстСообщения;

	КонецЕсли;
	
	// Кодировка берется из заголовков ответа, но если будут сбои, то использовать КодировкаТекста.UTF8
	Возврат Ответ.ПолучитьТелоКакСтроку();

КонецФункции // СформироватьДиаграммуНаСервисеPlantUML()

#КонецОбласти

#Область ПостроениеJSON_Запрос1С

Функция Сформировать_СхемаЗапросаVIS_СхемаЗапроса1С(СхемаЗапроса, ИменаТаблиц) Экспорт
	
	ДанныеСхемыЗапроса = ТаблицыПакетовЗапроса(СхемаЗапроса, ИменаТаблиц);
	
	СхемаЗапросаVIS = ЗаполнитьJSONДляЗапроса(ДанныеСхемыЗапроса);
	
	Возврат СхемаЗапросаVIS;
	
КонецФункции // Сформировать_СхемаЗапросаVIS_СхемаЗапроса1С()

Функция ТаблицыПакетовЗапроса(СхемаЗапроса, ИменаТаблиц)
	
	НомерЗапроса = 0;
	ВременныеТаблицы = Новый Соответствие();
	ЭлементыСхемыЗапроса = Новый ДеревоЗначений();
	ЭлементыСхемыЗапроса.Колонки.Добавить("Идентификатор");
	ЭлементыСхемыЗапроса.Колонки.Добавить("Представление");
	ЭлементыСхемыЗапроса.Колонки.Добавить("Тип");
	ЭлементыСхемыЗапроса.Колонки.Добавить("ТекстЗапроса");
	
	СоедниненияТаблиц = Новый ТаблицаЗначений();
	СоедниненияТаблиц.Колонки.Добавить("Группа");
	СоедниненияТаблиц.Колонки.Добавить("Источник");
	СоедниненияТаблиц.Колонки.Добавить("Приемник");
	СоедниненияТаблиц.Колонки.Добавить("ТипСоединения");
	СоедниненияТаблиц.Колонки.Добавить("ПсевдонимТаблицы");
	СоедниненияТаблиц.Колонки.Добавить("Условие");
	
	Для Каждого ПакетЗапроса Из СхемаЗапроса.ПакетЗапросов Цикл

		ИспользуемыеВременныеТаблицы = Новый Массив();
		НомерЗапроса = НомерЗапроса + 1;

		Если ТипЗнч(ПакетЗапроса) = Тип("ЗапросУничтоженияТаблицыСхемыЗапроса") Тогда

			ИдентификаторУдаляемойТаблицы = ВременныеТаблицы.Получить(ПакетЗапроса.ИмяТаблицы);
			Если ИдентификаторУдаляемойТаблицы <> Неопределено Тогда
				ГруппаРодитель = ЭлементыСхемыЗапроса.Строки.Добавить();
				ГруппаРодитель.Идентификатор = ИдентификаторУдаляемойТаблицы;
				ГруппаРодитель.Представление = ПакетЗапроса.ИмяТаблицы;
				ГруппаРодитель.Тип = "DROP";
			КонецЕсли;
			
			Продолжить;

		КонецЕсли;

		Если ПустаяСтрока(ПакетЗапроса.ТаблицаДляПомещения) Тогда

			НоваяГруппа = ЭлементыСхемыЗапроса.Строки.Добавить();
			НоваяГруппа.Идентификатор = Строка(Новый УникальныйИдентификатор());
			НоваяГруппа.Представление = СтрШаблон("ПакетЗапроса%1", Формат(НомерЗапроса, "ЧГ=;"));
			НоваяГруппа.Тип = "SELECT";
			НоваяГруппа.ТекстЗапроса = СформироватьТекстЗапроса(
				ПакетЗапроса.ПолучитьТекстЗапроса(),
				ИменаТаблиц);

		Иначе

			НоваяГруппа = ЭлементыСхемыЗапроса.Строки.Добавить();
			НоваяГруппа.Идентификатор = Строка(Новый УникальныйИдентификатор());
			НоваяГруппа.Представление = ПакетЗапроса.ТаблицаДляПомещения;
			НоваяГруппа.Тип = "INSERT";
			ВременныеТаблицы.Вставить(ПакетЗапроса.ТаблицаДляПомещения, НоваяГруппа.Идентификатор);
			НоваяГруппа.ТекстЗапроса = СформироватьТекстЗапроса(
				ПакетЗапроса.ПолучитьТекстЗапроса(),
				ИменаТаблиц);

		КонецЕсли;
		
		СозданиеНовойГруппыПоТекстуЗапроса(
			НоваяГруппа,
			ПакетЗапроса,
			ИменаТаблиц,
			ВременныеТаблицы,
			СоедниненияТаблиц);

	КонецЦикла;
	
	Результат = Новый Структура();
	Результат.Вставить("ЭлементыСхемыЗапроса", ЭлементыСхемыЗапроса);
	Результат.Вставить("СоедниненияТаблиц",    СоедниненияТаблиц);
	
	Возврат Результат;
	
КонецФункции

Процедура СозданиеНовойГруппыПоТекстуЗапроса(
		ГруппаЗапроса,
		ПакетЗапроса,
		ИменаТаблиц,
		ВременныеТаблицы,
		СоедниненияТаблиц)

	ГруппироватьОбъединения = ПакетЗапроса.Операторы.Количество() > 1;
	
	Если ГруппироватьОбъединения Тогда
		ГруппаОбъединения = ГруппаЗапроса.Строки.Добавить();
		ГруппаОбъединения.Идентификатор = Строка(Новый УникальныйИдентификатор());
		Если ПакетЗапроса.Операторы[1].ТипОбъединения = ТипОбъединенияСхемыЗапроса.Объединить Тогда
			ГруппаОбъединения.Представление = НСтр("ru = 'ОБЪЕДИНИТЬ'");
		Иначе
			ГруппаОбъединения.Представление = НСтр("ru = 'ОБЪЕДИНИТЬ ВСЕ'");
		КонецЕсли;
		ГруппаОбъединения.Тип = "UNION";
	КонецЕсли;
	
	СписокТаблиц = Новый Массив();
	НомерТаблицыОбъединения = 0;
	
	ИсточникБезСоединения = "";
	Для Каждого Оператор Из ПакетЗапроса.Операторы Цикл
		
		НомерТаблицыОбъединения = НомерТаблицыОбъединения + 1;
		
		СоответствиеИменТаблиц = Новый Соответствие();
		
		Если ГруппироватьОбъединения Тогда
			
			ГруппаУровня = ГруппаОбъединения.Строки.Добавить();
			ГруппаУровня.Идентификатор = Строка(Новый УникальныйИдентификатор());
			ГруппаУровня.Представление = СтрШаблон(НСтр("ru = 'ТаблицаОбъединения%1'"), Формат(НомерТаблицыОбъединения, "ЧГ=;"));
			ГруппаУровня.Тип = "SELECT";
			
		Иначе
			
			ГруппаУровня = ГруппаЗапроса;
			
		КонецЕсли;

		ПредыдущийИсточникТаблицы = "";
		СписокПсевдонимов = Новый Массив();
		Для Каждого ИсточникДанных Из Оператор.Источники Цикл

			ИдентификаторТаблицы = ИдентификаторТаблицыЗапроса(
				ИсточникДанных,
				ГруппаУровня,
				СоответствиеИменТаблиц,
				ВременныеТаблицы,
				ИменаТаблиц,
				СоедниненияТаблиц);

			Для Каждого Соединение Из ИсточникДанных.Соединения Цикл

				ИдентификаторТаблицыСоединения = ИдентификаторТаблицыЗапроса(
					Соединение.Источник,
					ГруппаУровня,
					СоответствиеИменТаблиц,
					ВременныеТаблицы,
					ИменаТаблиц,
					СоедниненияТаблиц);
				
				СписокПсевдонимов.Добавить(Соединение.Источник.Источник.Псевдоним);
				НайденныеСоединения = СоедниненияТаблиц.НайтиСтроки(
					Новый Структура("Группа,Источник,Приемник,ТипСоединения,ПсевдонимТаблицы",
					ГруппаУровня.Идентификатор, ИдентификаторТаблицы, ИдентификаторТаблицыСоединения, Соединение.ТипСоединения, Соединение.Источник.Источник.Псевдоним));
				
				Если НайденныеСоединения.Количество() > 0 Тогда
					НайденныеСоединения[0].Условие = СтрШаблон("%1%2И %3", НайденныеСоединения[0].Условие, Символы.ПС, Строка(Соединение.Условие));
					Продолжить;
				КонецЕсли;
				
				СоединениеТаблиц = СоедниненияТаблиц.Добавить();
				СоединениеТаблиц.Группа = ГруппаУровня.Идентификатор;
				СоединениеТаблиц.Источник = ИдентификаторТаблицы;
				СоединениеТаблиц.Приемник = ИдентификаторТаблицыСоединения;
				СоединениеТаблиц.ТипСоединения = Соединение.ТипСоединения;
				СоединениеТаблиц.ПсевдонимТаблицы = Соединение.Источник.Источник.Псевдоним;
				СоединениеТаблиц.Условие = Строка(Соединение.Условие);

			КонецЦикла;
			
			ЭтоТаблицаИсточник = СписокПсевдонимов.Найти(ИсточникДанных.Источник.Псевдоним) = Неопределено;
			
			Если Не ПустаяСтрока(ПредыдущийИсточникТаблицы) И ЭтоТаблицаИсточник Тогда
				СоединениеТаблиц = СоедниненияТаблиц.Добавить();
				СоединениеТаблиц.Группа = ГруппаУровня.Идентификатор;
				СоединениеТаблиц.Источник = ПредыдущийИсточникТаблицы;
				СоединениеТаблиц.Приемник = ИдентификаторТаблицы;
				СоединениеТаблиц.ТипСоединения = ТипСоединенияСхемыЗапроса.Внутреннее;
			КонецЕсли;
			
			Если ЭтоТаблицаИсточник Тогда
				ПредыдущийИсточникТаблицы = ИдентификаторТаблицы;
			КонецЕсли;
			
		КонецЦикла;

	КонецЦикла;
	
КонецПроцедуры

Функция ИдентификаторТаблицыЗапроса(
		Источник,
		ТекущаяГруппа,
		СоответствиеИменТаблиц,
		ВременныеТаблицы,
		ИменаТаблиц,
		СоедниненияТаблиц)
	
	Если ТипЗнч(Источник.Источник) = Тип("ВложенныйЗапросСхемыЗапроса") Тогда
		
		Возврат ИдентификаторВложенногоЗапроса(
			Источник.Источник,
			ТекущаяГруппа,
			ВременныеТаблицы,
			ИменаТаблиц,
			СоедниненияТаблиц,
			СоответствиеИменТаблиц);
		
	КонецЕсли;
	
	ИмяТаблицы = Источник.Источник.ИмяТаблицы;
	ИдентификаторТаблицы = СоответствиеИменТаблиц.Получить(ИмяТаблицы);
	
	Если ИдентификаторТаблицы <> Неопределено Тогда
		Возврат ИдентификаторТаблицы;
	КонецЕсли;
	
	Если СтрНайти(ИмяТаблицы, ".") = 0
		И Не СтрНачинаетсяС(ИмяТаблицы, "&")
		И ИменаТаблиц.Получить(ИмяТаблицы) <> Неопределено Тогда
		НаименованиеТаблицы = ИменаТаблиц.Получить(ИмяТаблицы);
	Иначе
		НаименованиеТаблицы = ИмяТаблицы;
	КонецЕсли;
	
	ИдентификаторВременнойТаблицы = ВременныеТаблицы.Получить(ИмяТаблицы);
	
	Если ЭтотОбъект.СворачиватьПромежуточныеУзлы Тогда
		
		Если ИдентификаторВременнойТаблицы <> Неопределено Тогда
			ТаблицаЗапроса = ТекущаяГруппа.Строки.Добавить();
			ТаблицаЗапроса.Идентификатор = ИдентификаторВременнойТаблицы;
			СоответствиеИменТаблиц.Вставить(ИмяТаблицы, ИдентификаторВременнойТаблицы);
			Возврат ИдентификаторВременнойТаблицы;
		КонецЕсли;
		
		ТаблицаЗапроса = ТекущаяГруппа.Строки.Добавить();
		ТаблицаЗапроса.Идентификатор = Строка(Новый УникальныйИдентификатор());
		ТаблицаЗапроса.Представление = НаименованиеТаблицы;
		ТаблицаЗапроса.Тип = "TABLE";
		СоответствиеИменТаблиц.Вставить(ИмяТаблицы, ТаблицаЗапроса.Идентификатор);
		
	Иначе
		
		ТаблицаЗапроса = ТекущаяГруппа.Строки.Добавить();
		ТаблицаЗапроса.Идентификатор = Строка(Новый УникальныйИдентификатор());
		ТаблицаЗапроса.Представление = НаименованиеТаблицы;
		
		ИдентификаторВременнойТаблицы = ВременныеТаблицы.Получить(ИмяТаблицы);
		Если ИдентификаторВременнойТаблицы <> Неопределено Тогда
			СтрокаВременнаяТаблица = ТаблицаЗапроса.Строки.Добавить();
			СтрокаВременнаяТаблица.Идентификатор = ИдентификаторВременнойТаблицы;
			ТаблицаЗапроса.Тип = "SELECT";
		Иначе
			ТаблицаЗапроса.Тип = "TABLE";
		КонецЕсли;
		СоответствиеИменТаблиц.Вставить(ИмяТаблицы, ТаблицаЗапроса.Идентификатор);
		
	КонецЕсли;
	
	Возврат ТаблицаЗапроса.Идентификатор;
	
КонецФункции

Функция ИдентификаторВложенногоЗапроса(
		Источник,
		ТекущаяГруппа,
		ВременныеТаблицы,
		ИменаТаблиц,
		СоедниненияТаблиц,
		СоответствиеИменТаблиц)
	
	НайденныйИдентификатор = СоответствиеИменТаблиц.Получить(Источник.Псевдоним);
	Если НайденныйИдентификатор <> Неопределено Тогда
		Возврат НайденныйИдентификатор;
	КонецЕсли;
	ИмяТаблицы = ИменаТаблиц.Получить(Источник.Псевдоним);
	Если ИмяТаблицы = Неопределено Тогда
		ИмяТаблицы = Источник.Псевдоним;
	КонецЕсли;
	
	ЧастиНаименования = СтрРазделить(ИмяТаблицы, ".");
	ПредставлениеОтбора = "Отбор";
	Если ЧастиНаименования.Количество() > 1
		И ЧастиНаименования[ЧастиНаименования.ВГраница()] = ПредставлениеОтбора Тогда
		ИмяТаблицы = ПредставлениеОтбора;
	КонецЕсли;
	
	ВложенныйЗапрос = ТекущаяГруппа.Строки.Добавить();
	ВложенныйЗапрос.Идентификатор = Строка(Новый УникальныйИдентификатор());
	ВложенныйЗапрос.Представление = ИмяТаблицы;
	ВложенныйЗапрос.Тип = "SELECT";
	ВложенныйЗапрос.ТекстЗапроса = СформироватьТекстЗапроса(
		Источник.Запрос.ПолучитьТекстЗапроса(),
		ИменаТаблиц);
	
	СоответствиеИменТаблиц.Вставить(Источник.Псевдоним, ВложенныйЗапрос.Идентификатор);
	
	СозданиеНовойГруппыПоТекстуЗапроса(
			ВложенныйЗапрос,
			Источник.Запрос,
			ИменаТаблиц,
			ВременныеТаблицы,
			СоедниненияТаблиц);
	
	Возврат ВложенныйЗапрос.Идентификатор;

КонецФункции

Функция СформироватьТекстЗапроса(ТекстПакетаЗапроса, ИменаТаблиц)
	
	РезультатТекстаЗапроса = ТекстПакетаЗапроса;
	
	Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл
		
		РезультатТекстаЗапроса = СтрЗаменить(РезультатТекстаЗапроса, ИмяТаблицы.Ключ, ИмяТаблицы.Значение);
		
	КонецЦикла;
	
	РезультатТекстаЗапроса = СтрЗаменить(РезультатТекстаЗапроса, Символы.Таб, "    ");
	
	Возврат РезультатТекстаЗапроса;
	
КонецФункции

Функция ЗаполнитьJSONДляЗапроса(ДанныеСхемыЗапроса)
	
	ДанныеJSON = Новый Массив();
	
	Для Каждого ТекущийПакетЗапроса Из ДанныеСхемыЗапроса.ЭлементыСхемыЗапроса.Строки Цикл
		
		ПакетЗапроса = Новый Массив();
		ЗаполнитьТаблицыИСвязиПакетаЗапросаJSON(ПакетЗапроса, ТекущийПакетЗапроса, ДанныеСхемыЗапроса.СоедниненияТаблиц);
		
		ДанныеJSON.Добавить(ПакетЗапроса);
		
	КонецЦикла;
	
	Возврат ДанныеJSON;
	
КонецФункции

Процедура ЗаполнитьТаблицыИСвязиПакетаЗапросаJSON(ПакетЗапроса, ЭлементЗапроса, Связи)
	
	Если ПустаяСтрока(ЭлементЗапроса.Тип)
		ИЛИ ЭлементЗапроса.Тип = "DROP" Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьТаблицуЗапроса(ПакетЗапроса, ЭлементЗапроса, Связи);
	
	Для Каждого ПодчиненныйЭлемент Из ЭлементЗапроса.Строки Цикл
		
		ЗаполнитьТаблицыИСвязиПакетаЗапросаJSON(ПакетЗапроса, ПодчиненныйЭлемент, Связи)
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьТаблицуЗапроса(ПакетЗапроса, ЭлементЗапроса, Связи)
	
	Если ПустаяСтрока(ЭлементЗапроса.Тип) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЭлемента = ШаблонЭлементаЗапроса();
	
	ПараметрыЭлемента.id = ЭлементЗапроса.Идентификатор;
	ПараметрыЭлемента.name = ЭлементЗапроса.Представление;
	ПараметрыЭлемента.type = ЭлементЗапроса.Тип;
	
	Если ЗначениеЗаполнено(ЭлементЗапроса.Родитель) Тогда
		ПараметрыЭлемента.parentid = ЭлементЗапроса.Родитель.Идентификатор;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементЗапроса.ТекстЗапроса) Тогда
		ПараметрыЭлемента.sql = ЭлементЗапроса.ТекстЗапроса;
	КонецЕсли;
	
	Для Каждого ПодчиненныйЭлемент Из ЭлементЗапроса.Строки Цикл
		
		ПараметрыЭлемента.relations.Добавить(ИдентификаторПодчиненногоЭлемента(ПодчиненныйЭлемент.Идентификатор));
		
	КонецЦикла;
	
	НайденныеСвязи = Связи.НайтиСтроки(Новый Структура("Группа", ЭлементЗапроса.Идентификатор));
	Для Каждого ТекущаяСтрока Из НайденныеСвязи Цикл
		
		ПараметрыСвязи = ШаблонСвязиТаблиц();
		ПараметрыСвязи.id = ТекущаяСтрока.Источник;
		ПараметрыСвязи.type = ВидыСоединенияЗапроса().Получить(ТекущаяСтрока.ТипСоединения);
		ПараметрыСвязи.on = ТекущаяСтрока.Приемник;
		ПараметрыСвязи.sql = ТекущаяСтрока.Условие;
		ПараметрыЭлемента.joins.Добавить(ПараметрыСвязи);
		
	КонецЦикла;
	
	ПакетЗапроса.Добавить(ПараметрыЭлемента);
	
КонецПроцедуры

Функция ШаблонЭлементаЗапроса()
	
	Шаблон = Новый Структура();
	Шаблон.Вставить("id", "");
	Шаблон.Вставить("name", "");
	Шаблон.Вставить("type", "");
	Шаблон.Вставить("parentid", "");
	Шаблон.Вставить("sql", "");
	Шаблон.Вставить("relations", Новый Массив());
	Шаблон.Вставить("joins", Новый Массив());
	
	Возврат Шаблон;
	
КонецФункции

Функция ИдентификаторПодчиненногоЭлемента(Идентификатор)
	
	Возврат Новый Структура("id", Идентификатор);
	
КонецФункции

Функция ШаблонСвязиТаблиц()
	
	Шаблон = Новый Структура();
	Шаблон.Вставить("id", "");
	Шаблон.Вставить("type", "");
	Шаблон.Вставить("on", "");
	Шаблон.Вставить("sql", "");
	
	Возврат Шаблон;
	
КонецФункции

Функция ВидыСоединенияЗапроса()
	
	ВидыСоединений = Новый Соответствие();
	ВидыСоединений.Вставить(ТипСоединенияСхемыЗапроса.Внутреннее, "INNER JOIN");
	ВидыСоединений.Вставить(ТипСоединенияСхемыЗапроса.ЛевоеВнешнее, "LEFT JOIN");
	ВидыСоединений.Вставить(ТипСоединенияСхемыЗапроса.ПолноеВнешнее, "FULL JOIN");
	ВидыСоединений.Вставить(ТипСоединенияСхемыЗапроса.ПравоеВнешнее, "RIGHT JOIN");
	
	Возврат ВидыСоединений;
	
КонецФункции

#КонецОбласти

#Область ПостроениеVISJS_Параметры

Функция СформироватьДиаграммуVISJS(СхемаЗапросаVIS, Узлы, Ребра, ПолеСхемыVISJS) Экспорт
	
	СтруктураНастроекВизуализации = ПолучитьСтруктуруНастроекВизуализации(СхемаЗапросаVIS);
	Если СтруктураНастроекВизуализации=Неопределено Тогда
		УзлыJS  = "";
		РебраJS = "";
		ПолеСхемыVISJS = 
		"<html>
		|<head>
		|<p>Нет данных</p>
		|</head>
		|
		|</html>";
		Возврат Ложь;
	КонецЕсли;
	
	Результат = СформироватьТекстПоляHTMLГрафа(СтруктураНастроекВизуализации);
	Узлы  = Результат.nodes;
	Ребра = Результат.edges;
	ПолеСхемыVISJS = Результат.HTML;
	Возврат Истина;
	
КонецФункции // СформироватьДиаграммуVISJS()

Функция ПолучитьСтруктуруНастроекВизуализации(СхемаЗапросаVIS)
	
	НастройкиСпецУзловИРебер = Новый Структура;
	НастройкиСпецУзловИРебер.Вставить("CREATE", 		Новый Структура("СвойстваЦвета", Новый Структура("ЦветФона", "#FF2299")));
	НастройкиСпецУзловИРебер.Вставить("INSERT", 		Новый Структура("СвойстваЦвета", Новый Структура("ЦветФона", "#FF9922")));
	НастройкиСпецУзловИРебер.Вставить("SELECT", 		Новый Структура("СвойстваЦвета", Новый Структура("ЦветФона", "#FF9999")));
	НастройкиСпецУзловИРебер.Вставить("TABLE", 			Новый Структура("СвойстваЦвета", Новый Структура("ЦветФона", "#CEEBCE"))); //"#33FF33" - слишком кислотный, поставил пастельный
	НастройкиСпецУзловИРебер.Вставить("UNION", 			Новый Структура("СвойстваЦвета,Форма", Новый Структура("ЦветФона", "#229999"),"ellipse"));
	
	НастройкиСпецУзловИРебер.Вставить("SELECTВыборки", 			Новый Структура("СвойстваЦвета, Форма, ТолщинаЛинии", Новый Структура("ЦветФона", "#FF55FF"),"star", 3));
	
	НастройкиСпецУзловИРебер.Вставить("РеброВременнойТаблицы", 	Новый Структура("СвойстваЦвета", Новый Структура("Цвет, ЦветНаведения", "green", "#77CC77")));
	НастройкиСпецУзловИРебер.Вставить("РеброСвязи", 	Новый Структура("СвойстваЦвета", Новый Структура("Цвет, ЦветНаведения", "red", "#CC7777")));
	//['ellipse', 'box', 'circle', 'database', 'diamond', 'dot', 'square', 'star', 'text', 'triangle', 'triangleDown', 'hexagon'],
	
    Множитель = 5;
	БазовыйСдвигПоГоризонтали 	= 50*Множитель; 
	ВнутреннийСдвигПоВертикали 	= 20*Множитель;
	БазовыйСдвигУзла 	= 30*Множитель *?(ЭтотОбъект.НаправлениеПостроения,-1,1); // + КоличествоУзловНаОдномУровне*ВнутреннийСдвигПоВертикали;
	//БазовыйСдвигПакета = ?(ЭтотОбъект.НаправлениеПостроения, 0, 500;
	
	НастройкиОтображенияУзловИРебер = Новый Структура("НастройкиСпецУзловИРебер, БазовыйСдвигУзла", НастройкиСпецУзловИРебер, БазовыйСдвигУзла );
	
	МассивИдентификаторовРебер = Новый Массив;
	
    ИдентификаторCREATE = "CREATE_";
	ИдентификаторINSERT = "INSERT_";
	
	МассивУзлы 		= Новый Массив;
	МассивРебра 	= Новый Массив;
	ИменаВременныхТаблиц = Новый Массив;
	
	
	МассивКластеры	= Новый Массив;
	
	X = 0;
	Y = 0;
	
	Для ИндексПакета = 0 По СхемаЗапросаVIS.ВГраница() Цикл
		
		ИскатьУзелВыборки 		= Истина;
		
		ТекущийПакет = СхемаЗапросаVIS[ИндексПакета];
		СоответствиеКластеров = Новый Соответствие;
		СоответствиеУзловКластерам = Новый Соответствие;
	    КоординатыУзлов = Новый Соответствие;
		
		Если ЭтотОбъект.НаправлениеПостроения Тогда // Пакеты по-вертикали, узлы по-горизонтали(1)
			Y = Y + ЭтотОбъект.СдвигПакета;
			X = 0;			
		Иначе                            // Узлы по-вертикали, пакеты по-горизонтали(0)
			X = X + ЭтотОбъект.СдвигПакета;
			Y = 0;		
		КонецЕсли;
		
		//X = X + БазовыйСдвигПакета;
		//Y = 0;
		Если ТипЗнч(ТекущийПакет) = Тип("Соответствие") Тогда
			
			ТекущийУзел = ТекущийПакет;
			ИдентификаторПакета = "";
			ЭтоФинальныйУзелВыборки = Ложь;
		    ЭтоУзелВременнойТаблицы = Ложь;
	

			Результат = СформироватьУзелПакета(ТекущийУзел, МассивРебра, МассивУзлы, X, Y, КоординатыУзлов, ИдентификаторПакета, НастройкиОтображенияУзловИРебер, ИменаВременныхТаблиц, МассивИдентификаторовРебер, ЭтоУзелВременнойТаблицы, ИскатьУзелВыборки,ЭтоФинальныйУзелВыборки);

			//НастройкиОтображенияУзла = Новый Структура;
			//ДобавитьУзел(МассивУзлы, ТекущийПакет["id"], ТекущийПакет["id"], X, Y, НастройкиОтображенияУзла);
            //Продолжить;
			
		Иначе
			ИдентификаторПакета = "";
			Для ИндексУзла = 0 По ТекущийПакет.ВГраница() Цикл
				ТекущийУзел = ТекущийПакет[ИндексУзла];
				ИсходныйИдентификаторУзла = ТекущийУзел["id"];
	            ДобавлятьИдентификаторПакета = Истина;
				ЭтоУзелВременнойТаблицы = Ложь;
				ЭтоФинальныйУзелВыборки = Ложь;
		
				ИдентификаторУзла = Неопределено;
                Результат = СформироватьУзелПакета(ТекущийУзел, МассивРебра, МассивУзлы, X, Y, КоординатыУзлов, ИдентификаторПакета, НастройкиОтображенияУзловИРебер, ИменаВременныхТаблиц, МассивИдентификаторовРебер,  ЭтоУзелВременнойТаблицы, ИскатьУзелВыборки, ЭтоФинальныйУзелВыборки);

				Если Результат = Неопределено Тогда
					Продолжить;				
				КонецЕсли;
				МассивВходящихИдентификаторов 	= Результат.МассивВходящихИдентификаторов;
				ИдентификаторУзла 				= Результат.ИдентификаторУзла;
								
				Если ЭтотОбъект.Кластеризовать И МассивВходящихИдентификаторов.Количество() Тогда
					ИмяУзла = ТекущийУзел["name"];
					ИдентификаторКластера 	= СтрШаблон("cluster_%1",ИдентификаторУзла);
					ЗаголовокКластера 		= ?(ЭтоУзелВременнойТаблицы, СтрШаблон("Временная таблица: \n ""%1""",ИмяУзла),ИмяУзла);
					ЗаголовокРебраКластера 	= ?(ЭтоУзелВременнойТаблицы, "","Вложенный запрос");
					
					СтруктураКластера = Новый Структура("Идентификатор, ВходящиеИдентификаторы, Заголовок, ЗаголовокРебра", 
						ИдентификаторКластера, МассивВходящихИдентификаторов, ЗаголовокКластера, ЗаголовокРебраКластера);
					
					Для каждого ИдентификаторВходящегоУзла Из МассивВходящихИдентификаторов Цикл
						СоответствиеУзловКластерам.Вставить(ИдентификаторВходящегоУзла, ИдентификаторКластера);					
					КонецЦикла;
					МассивВходящихИдентификаторов.Добавить(ИдентификаторУзла);
					
					СоответствиеКластеров.Вставить(ИдентификаторКластера, СтруктураКластера);				
					
					ИдентификаторИсходящегоКластера = СоответствиеУзловКластерам[ИдентификаторУзла];
					Если ИдентификаторИсходящегоКластера <> Неопределено Тогда
						НастройкиИсходящегоКластера = СоответствиеКластеров[ИдентификаторИсходящегоКластера];
						ИндексВходящегоУзла = НастройкиИсходящегоКластера.ВходящиеИдентификаторы.Найти(ИдентификаторУзла);
						НастройкиИсходящегоКластера.ВходящиеИдентификаторы[ИндексВходящегоУзла] = ИдентификаторКластера;					
					КонецЕсли;					
									
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		Для каждого КлючЗначение Из СоответствиеКластеров Цикл 	
			СтруктураКластера = КлючЗначение.Значение;
			//СтруктураКластера.Вставить("X", X);
			СтруктураКластера.Вставить("Y", Y);
			МассивКластеры.Добавить(СтруктураКластера);
		КонецЦикла;
	
	КонецЦикла;
	                          
	
	
	//СтруктураКластера = Новый Структура("Идентификатор, ВходящиеИдентификаторы, Заголовок, ЗаголовокРебра", ИдентификаторКластера, МассивВходящихИдентификаторов, ЗаголовокКластера, ЗаголовокРебраКластера);
	
	//НастройкиКластера.Вставить(
	
	//clusterNodes('cluster_UNION_T3_T5', ['SELECT_T3_T4','SELECT_T5_T6','UNION_T3_T5'], '\n\n\nОбъединение\n2 пакета', 15, 'Вложенный запрос', 5);	
	//clusterNodes('cluster_SELECT_T2', ['cluster_UNION_T3_T5','SELECT_T2'], '\n\n\nSELECT_T2', 15, 'Вложенный запрос', 5);	
	////clusterNodes('cluster_Monitoring62', ['CREATE_Monitoring62','INSERT_Monitoring62', 'SELECT_T1','SELECT_T2','UNION_T3_T5','SELECT_T3_T4','SELECT_T5_T6'], 'Временная таблица Monitoring62', 15, '', 5);	
	//clusterNodes('cluster_Monitoring62', ['CREATE_Monitoring62','INSERT_Monitoring62', 'SELECT_T1','cluster_SELECT_T2'], '\n\n\n\nВременная таблица \nMonitoring62\n6 узлов', 25, '', 5);	

	//ШаблонКластера = "clusterNodes('%1', [%2], '%3', %4, '%5', %6);	";
	//ТекстКластера = СтрШаблон(ШаблонКластера,ИдентификаторКластера,ТекстВходящихИдентификаторов, ЗаголовокКластера, РазмерШрифта, ЗаголовокРебраКластера, ТолщинаРебра);
	
	
	СтруктураНастроекВизуализации = Новый Структура;
	СтруктураНастроекВизуализации.Вставить("Узлы",	МассивУзлы);
	СтруктураНастроекВизуализации.Вставить("Ребра",	МассивРебра);
	СтруктураНастроекВизуализации.Вставить("Кластеры",	МассивКластеры);
	
	//!!!НастройкиОтображения = Новый Структура("Физика, БлокировкаПоВертикали, БлокировкаПоГоризонтали", ЭтотОбъект.Физика, ЭтотОбъект.БлокировкаПоВертикали, ЭтотОбъект.БлокировкаПоГоризонтали);
	//!!!СтруктураНастроекВизуализации.Вставить("НастройкиОтображения",НастройкиОтображения);
		
	Возврат СтруктураНастроекВизуализации;

КонецФункции

Функция СформироватьУзелПакета(ТекущийУзел, МассивРебра, МассивУзлы, X, Y, КоординатыУзлов, ИдентификаторПакета, НастройкиОтображенияУзловИРебер, ИменаВременныхТаблиц, МассивИдентификаторовРебер, ЭтоУзелВременнойТаблицы, ИскатьУзелВыборки,ЭтоФинальныйУзелВыборки)
	
	НастройкиСпецУзловИРебер 	= НастройкиОтображенияУзловИРебер.НастройкиСпецУзловИРебер;
	БазовыйСдвигУзла 			= НастройкиОтображенияУзловИРебер.БазовыйСдвигУзла;
	
	ИсходныйИдентификаторУзла 	= ТекущийУзел["id"];	
	ИмяУзла 					= ТекущийУзел["name"];	
	ИдентификаторРодительскогоУзла = ТекущийУзел["parentid"];
	ТипУзла 					= ТекущийУзел["type"];
	ТекстЗапросаУзла			= ТекущийУзел["sql"];
	ИдентификаторУзла = ИсходныйИдентификаторУзла;
	
	Если ТипУзла = "CREATE" ИЛИ ТипУзла = "DROP" Тогда
		Возврат Неопределено;	
	ИначеЕсли ТипУзла = "INSERT" Тогда
		ИдентификаторПакета = СтрШаблон("Пакет_%1",ИдентификаторУзла);
		ЭтоУзелВременнойТаблицы = Истина;
		ИменаВременныхТаблиц.Добавить(ИдентификаторУзла);
		//ИдентификаторПакета = СтрЗаменить(ИдентификаторУзла,ИдентификаторINSERT,"");
		
		ДобавлятьИдентификаторПакета = Ложь;
		
	ИначеЕсли ИменаВременныхТаблиц.Найти(ИдентификаторУзла) = Неопределено Тогда // НЕ СтрНачинаетсяС(ИдентификаторУзла,"_") Тогда
		ИдентификаторУзла = СтрШаблон("%1_%2", ИдентификаторПакета, ИдентификаторУзла);
		
		Если ТипУзла = "SELECT" И ИскатьУзелВыборки Тогда
			ЭтоФинальныйУзелВыборки 	= Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИскатьУзелВыборки 		= Ложь;
	
	НастройкиОтображенияУзла = Новый Структура;
	ТекНастройки = Неопределено;
	ИмяНастройки = ?(ЭтоФинальныйУзелВыборки, "SELECTВыборки", ТипУзла);
	
	Если НастройкиСпецУзловИРебер.Свойство(ИмяНастройки,ТекНастройки) Тогда
		
		Для каждого КлючЗначение Из ТекНастройки Цикл
			НастройкиОтображенияУзла.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;		
		
	КонецЕсли;
	
	
	XНачальная = 0;
	YНачальная = 0;
	СдвигВнутриРодителя = 0;
	КоординатыРодителя = КоординатыУзлов[ИдентификаторРодительскогоУзла];
	Если КоординатыРодителя <> Неопределено Тогда
		XНачальная = КоординатыРодителя.X;
		YНачальная = КоординатыРодителя.Y;
		СдвигВнутриРодителя = КоординатыРодителя.Сдвиг;
	КонецЕсли;
	
	Если ЭтотОбъект.НаправлениеПостроения = 0 Тогда     //Узлы по-вертикали, пакеты по-горизонтали(0)
		Y = YНачальная + ЭтотОбъект.СдвигУзла; //*?(ЭтоФинальныйУзелВыборки,0.5,1);
		X = X + СдвигВнутриРодителя;		
	Иначе 		//Пакеты по-вертикали, узлы по-горизонтали(1)
		X = XНачальная + ЭтотОбъект.СдвигУзла;
		Y = Y + СдвигВнутриРодителя;		
	КонецЕсли;
	
	Если КоординатыРодителя <> Неопределено Тогда
		КоординатыРодителя.Вставить("Сдвиг",СтрДлина(ИмяУзла)*15); 
	КонецЕсли;
	//	Y = Y - БазовыйСдвигУзла*?(ЭтоФинальныйУзелВыборки,0.5,1);
	//Иначе
	//	Y = КоординатыРодителя.Y - БазовыйСдвигУзла*?(ЭтоФинальныйУзелВыборки,0.5,1);
	//КонецЕсли;
	
	КоординатыУзлов.Вставить(ИсходныйИдентификаторУзла,Новый Структура("X,Y, Сдвиг",X,Y, 0));
	
	ДобавитьУзел(МассивУзлы, ИдентификаторУзла, ИмяУзла, X, Y, НастройкиОтображенияУзла, ТекстЗапросаУзла);
	
	ТекИдентификаторНачало = ИдентификаторУзла;
	
	Отношения = ТекущийУзел["relations"];
	
	МассивВходящихИдентификаторов = Новый Массив;				
	Для каждого Связь Из Отношения Цикл
		ИсходныйИдентификаторКонец = Связь["id"];
		Если НЕ ЗначениеЗаполнено(ИсходныйИдентификаторКонец) Тогда
			Продолжить;				
		КонецЕсли;					
		
		ТекИдентификаторРебра 	= СтрШаблон("%1_Ребро_%2_%3",ИдентификаторПакета, ИсходныйИдентификаторУзла, ИсходныйИдентификаторКонец);                                        
		Если ИменаВременныхТаблиц.Найти(ИсходныйИдентификаторКонец) <> Неопределено Тогда //СтрНачинаетсяС(ИсходныйИдентификаторКонец,"_") Тогда
			ТекИдентификаторКонец = ИсходныйИдентификаторКонец;	
		Иначе
			ТекИдентификаторКонец = СтрШаблон("%1_%2", ИдентификаторПакета, ИсходныйИдентификаторКонец);		
		КонецЕсли;
		
		
		НастройкиОтображенияРебра = Новый Структура;
		
		Если ИменаВременныхТаблиц.Найти(ТекИдентификаторКонец) = Неопределено Тогда
			МассивВходящихИдентификаторов.Добавить(ТекИдентификаторКонец);
		Иначе						
			Для каждого КлючЗначение Из НастройкиСпецУзловИРебер.РеброВременнойТаблицы Цикл
				НастройкиОтображенияРебра.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
			КонецЦикла;						
		КонецЕсли;
		
		Если ТипУзла = "CREATE" Тогда
			НастройкиОтображенияРебра.Вставить("ВидСтрелки","to");
		Иначе
			НастройкиОтображенияРебра.Вставить("ВидСтрелки","from");						
		КонецЕсли;
		
		ОписаниеРебра = "";
		ДобавитьРебро(МассивРебра, МассивИдентификаторовРебер, ТекИдентификаторРебра, ТекИдентификаторНачало, ТекИдентификаторКонец, ОписаниеРебра, НастройкиОтображенияРебра);
				
	КонецЦикла;
	
	Связи = ТекущийУзел["joins"];
	Для каждого Связь Из Связи Цикл
		ИсходныйИдентификаторКонец 	= Связь["id"];
		
		ТипСвязи 	= Связь["type"];
		УзелСвязи 	= Связь["on"];		
		
		ТекИдентификаторРебра 	= СтрШаблон("%1_Ребро_%2_%3_%4",ИдентификаторПакета, УзелСвязи, ТипСвязи, ИсходныйИдентификаторКонец);                                        
		
		ТекИдентификаторНачалоВложенный = УзелСвязи;
		Если ИменаВременныхТаблиц.Найти(УзелСвязи) = Неопределено Тогда//НЕ СтрНачинаетсяС(УзелСвязи,"_") Тогда
			ТекИдентификаторНачалоВложенный = СтрШаблон("%1_%2", ИдентификаторПакета, УзелСвязи);		
		КонецЕсли;
		
		ТекИдентификаторКонец = ИсходныйИдентификаторКонец;	
		Если ИменаВременныхТаблиц.Найти(ИсходныйИдентификаторКонец) = Неопределено Тогда //СтрНачинаетсяС(ИсходныйИдентификаторКонец,"_") Тогда
			ТекИдентификаторКонец = СтрШаблон("%1_%2", ИдентификаторПакета, ИсходныйИдентификаторКонец);		
		КонецЕсли;
		
		
		НастройкиОтображенияРебра = Новый Структура;      
		Для каждого КлючЗначение Из НастройкиСпецУзловИРебер.РеброСвязи Цикл
			НастройкиОтображенияРебра.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;	
		Если ТипСвязи = "INNER JOIN" Тогда
			НастройкиСтрелок = Новый Структура("Входящая, Исходящая", "circle","circle");
			НастройкиОтображенияРебра.Вставить("НастройкиСтрелок", НастройкиСтрелок);							
		ИначеЕсли ТипСвязи = "LEFT JOIN" ИЛИ ТипСвязи = "LEFT OUTER JOIN" Тогда
			НастройкиСтрелок = Новый Структура("Входящая", "circle");
			НастройкиСтрелок.Вставить("Исходящая", Новый Структура("Тип, ВысотаКартинки, ШиринаКартинки, Источник", "image", 20,20,
			//"https://img.icons8.com/?size=100&id=22037&format=png&color=000000" 
			//"https://img.icons8.com/?size=100&id=22010&format=png&color=000000"
			//"data:image/svg+xml,%3Csvg xmlns=""http://www.w3.org/2000/svg"" viewBox=""0 0 100 100""%3E%3Ccircle cx=""50"" cy=""50"" r=""45"" fill=""%23f0f0f0"" stroke=""%23333"" stroke-width=""2""/%3E%3Ctext x=""50"" y=""50"" font-size=""20"" font-family=""Arial, sans-serif"" text-anchor=""middle"" dominant-baseline=""middle"" fill=""%23333""%3EText%3C/text%3E%3C/svg%3E"
			"data:image/svg+xml,%3Csvg xmlns=""http://www.w3.org/2000/svg"" viewBox=""0 0 100 100""%3E%3Ccircle cx=""50"" cy=""50"" r=""45"" fill=""%23f0f0f0"" stroke=""red"" stroke-width=""4""/%3E%3Ctext x=""50"" y=""50"" font-size=""20"" font-family=""Arial, sans-serif"" text-anchor=""middle"" dominant-baseline=""middle"" fill=""%23333""%3E%3C/text%3E%3C/svg%3E"
			));
			НастройкиОтображенияРебра.Вставить("НастройкиСтрелок", НастройкиСтрелок);
			//	from: {enabled: true, type: 'image',
			//imageHeight:30, imageWidth:30,
			//src:'https://img.icons8.com/?size=100&id=22010&format=png&color=000000'
			//
		КонецЕсли;
		
		ОписаниеРебра = ?(Связь["sql"]<>Неопределено, Связь["sql"], ТипСвязи);
		ДобавитьРебро(МассивРебра, МассивИдентификаторовРебер, ТекИдентификаторРебра, ТекИдентификаторНачалоВложенный, ТекИдентификаторКонец, ОписаниеРебра, НастройкиОтображенияРебра);
		
		
		
	КонецЦикла;
	
	
	Результат = Новый Структура("МассивВходящихИдентификаторов,ИдентификаторУзла", МассивВходящихИдентификаторов, ИдентификаторУзла);
					
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьУзел(МассивУзлы, Идентификатор, Имя, X, Y, НастройкиОтображенияУзла, Знач Заголовок = "")

	ПолныйЗаголовок = Заголовок;
	УкоротитьЗаголовок(Заголовок, "узел", 10);	
	
	СтруктураУзла = Новый Структура("Идентификатор, Имя, Заголовок, ПолныйЗаголовок, НавигационнаяСсылка", Идентификатор, Имя, Заголовок, ПолныйЗаголовок);
	
	НастройкиОтображенияУзла.Вставить("X",X);
	НастройкиОтображенияУзла.Вставить("Y",Y);
	СтруктураУзла.Вставить("НастройкиОтображения",НастройкиОтображенияУзла);
	МассивУзлы.Добавить(СтруктураУзла);
	
КонецПроцедуры

Процедура ДобавитьРебро(МассивРебра, МассивИдентификаторовРебер, ИдентификаторРебра, ИдентификаторНачало, ИдентификаторКонец, ЗаголовокРебра, НастройкиОтображенияРебра = Неопределено, НавигационнаяСсылкаРебра = "")

	Если МассивИдентификаторовРебер.Найти(ИдентификаторРебра) <> Неопределено Тогда
		Если Отладка Тогда
			Сообщить(СтрШаблон("Ребро с идентификатором %1 уже существует, пропускаем", ИдентификаторРебра));	
		КонецЕсли;
		Возврат;
	Иначе
		МассивИдентификаторовРебер.Добавить(ИдентификаторРебра);	
	КонецЕсли;
		
	ИмяРебра = ""; 
	
	ПолныйЗаголовок = ЗаголовокРебра;
	УкоротитьЗаголовок(ЗаголовокРебра, "ребро", 10);	
	
	СтруктураРебра = Новый Структура("Идентификатор, Имя, Заголовок, ПолныйЗаголовок, ИдентификаторНачало, ИдентификаторКонец, НавигационнаяСсылка", ИдентификаторРебра, ИмяРебра, ЗаголовокРебра, ПолныйЗаголовок, ИдентификаторНачало, ИдентификаторКонец, НавигационнаяСсылкаРебра);
	Если ЗначениеЗаполнено(НастройкиОтображенияРебра) Тогда
		НастройкиОтображения = НастройкиОтображенияРебра;
		Для каждого КлючЗначение Из НастройкиОтображенияРебра Цикл
			НастройкиОтображения.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
	    СтруктураРебра.Вставить("НастройкиОтображения",НастройкиОтображения);
	КонецЕсли;
	МассивРебра.Добавить(СтруктураРебра);

КонецПроцедуры

Процедура УкоротитьЗаголовок(Заголовок, ИмяЭлемента = "узел", ЛимитСтрок = 10)
	
	Если СтрЧислоСтрок(Заголовок) > ЛимитСтрок Тогда
		МассивПолныйЗаголовок = СтрРазделить(Заголовок, Символы.ПС);
		МассивУкороченныйЗаголовок = Новый Массив;
		Для н = 0 По ЛимитСтрок-1 Цикл
			МассивУкороченныйЗаголовок.Добавить(МассивПолныйЗаголовок[н]);	
		КонецЦикла;
		
		МассивУкороченныйЗаголовок.Добавить("...");
		МассивУкороченныйЗаголовок.Добавить(СтрШаблон(" и ещё %1 строк, <font color=""red"">чтобы увидеть весь текст нажмите дважды на %2</font>",СтрЧислоСтрок(Заголовок)-ЛимитСтрок, ИмяЭлемента));
		Заголовок = СтрСоединить(МассивУкороченныйЗаголовок, Символы.ПС);
	КонецЕсли;	

КонецПроцедуры

// Нет ссылок на функцию
Функция ПолучитьИдентификаторУзла(УзелСсылка)
	
	Если УзелСсылка.Пустая() Тогда
		ИдентификаторУзла = "ПустойИдентификатор";	
	Иначе
		ИдентификаторУзла = Строка(УзелСсылка.УникальныйИдентификатор());
	КонецЕсли;
	Возврат ИдентификаторУзла;

КонецФункции

#КонецОбласти

#Область ПостроениеVISJS_HTML

Функция СформироватьТекстПоляHTMLГрафа(СтруктураНастроекВизуализации, Отладка = Ложь) Экспорт
	
	ИдентификаторСхемы = "mynetwork";
	
	Узлы 	= СтруктураНастроекВизуализации.Узлы;
	Ребра 	= СтруктураНастроекВизуализации.Ребра;
	Кластеры = СтруктураНастроекВизуализации.Кластеры;
	
	//!!!НастройкиОтображения = СтруктураНастроекВизуализации.НастройкиОтображения;
	Массивnodes = Новый Массив;
	Массивedges = Новый Массив;
	
	ШаблонОсновныеСвойстваУзла = "			""id"": ""%1"", 
		|			""label"": ""%2"", 
		|			""URL"": ""%3""";
	
	СтатичныеСвойстваУзла = "			""heightConstraint"":50,
		|			""shadow"": true,
		|			""borderWidth"": 1";
	//ШаблонУзла = "
	//	|    {	id: '%1', 
	//	|			label: '%2', 
	//	|			%3 
	//	|			URL: '%4', %5
	//	|			%6
	//	//|			parent: 0,
	//	//|			order: 0,
	//	//|			incomingnode: false,
	//	|			heightConstraint:50,
	//	|			shadow: true,
	//	|			borderWidth: 1,
	//	|			shape: 'box',
	//	|			font: {color: '#000000', size: 20},
	//	|			color: { %7 
	//	//|					background: 'red',
	//	|					border: '#000000',
	//	|					highlight: { border: 'BLUE'	}
	//	|					},
	//	|    }";

	
	Для каждого Узел Из Узлы Цикл
		
		Имя 		= СтрЗаменить(Узел.Имя,Символы.ПС, "\n");
		
		МассивСвойстваУзла = Новый Массив;	
		МассивСвойстваУзла.Добавить(СтрШаблон(ШаблонОсновныеСвойстваУзла, Узел.Идентификатор, Имя, Узел.НавигационнаяСсылка));
		Если ЗначениеЗаполнено(Узел.Заголовок) Тогда //Всплывает при наведении курсора
			МассивСвойстваУзла.Добавить(СтрШаблон("""title"": ""<pre>%1<pre>""", ОбработатьСтрокуДляHTML(Узел.Заголовок)));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Узел.ПолныйЗаголовок) Тогда //Всплывает при наведении курсора
			МассивСвойстваУзла.Добавить(СтрШаблон("""fulltitle"": ""%1""", ОбработатьСтрокуДляHTML(Узел.ПолныйЗаголовок)));
		КонецЕсли;
		
		МассивСвойстваУзла.Добавить(СтатичныеСвойстваУзла);
		
		//БлокировкаПоГоризонтали = Ложь;	
		НастройкиОтображенияУзла = Неопределено;
		Если Узел.Свойство("НастройкиОтображения", НастройкиОтображенияУзла) Тогда
					
		//	|			font: {color: '#000000', size: 20},		
			СвойстваШрифта = Неопределено;
			Если НастройкиОтображенияУзла.Свойство("СвойстваШрифта", СвойстваШрифта) Тогда
				МассивСвойстваШрифта = Новый Массив;
				
				Если СвойстваШрифта.Свойство("Размер") Тогда
					МассивСвойстваШрифта.Добавить(СтрШаблон("""size"": %1", Формат(СвойстваШрифта.Размер, "ЧН=0; ЧГ=0")))					
				КонецЕсли;
				
				Если СвойстваШрифта.Свойство("Цвет") Тогда
					МассивСвойстваШрифта.Добавить(СтрШаблон("""color"": ""%1""", СвойстваШрифта.Цвет));
				КонецЕсли;	
				
				МассивСвойстваУзла.Добавить(СтрШаблон("""font"": {%1}", СтрСоединить(МассивСвойстваШрифта, ",")));
			КонецЕсли;
			
		//	|			color: {
		//|					background: 'red',
		//|					border: '#000000',
		//|					highlight: { border: 'BLUE'	}
		//|					},
		    СвойстваЦвета = Неопределено; 
			Если НастройкиОтображенияУзла.Свойство("СвойстваЦвета", СвойстваЦвета) Тогда
				МассивСвойстваЦвета = Новый Массив;
				
				Если СвойстваЦвета.Свойство("ЦветГраницы") Тогда
					МассивСвойстваЦвета.Добавить(СтрШаблон("""border"": ""%1""", СвойстваЦвета.ЦветГраницы));
				КонецЕсли;
				
				Если СвойстваЦвета.Свойство("ЦветФона") Тогда
					МассивСвойстваЦвета.Добавить(СтрШаблон("""background"": ""%1""", СвойстваЦвета.ЦветФона));
				КонецЕсли;	
								
				МассивСвойстваУзла.Добавить(СтрШаблон("""color"": {%1}", СтрСоединить(МассивСвойстваЦвета, ",")));
			КонецЕсли;
			
			Если НастройкиОтображенияУзла.Свойство("X") Тогда
				МассивСвойстваУзла.Добавить(СтрШаблон("""x"": %1", Формат(НастройкиОтображенияУзла.X, "ЧН=0; ЧГ=0")));
			КонецЕсли;
			Если НастройкиОтображенияУзла.Свойство("Y") Тогда
				МассивСвойстваУзла.Добавить(СтрШаблон("""y"": %1", Формат(НастройкиОтображенияУзла.Y, "ЧН=0; ЧГ=0")));
			КонецЕсли;
			
			//Если НастройкиОтображенияУзла.Свойство("БлокировкаПоГоризонтали") Тогда
			//	БлокировкаПоГоризонтали = НастройкиОтображенияУзла.БлокировкаПоГоризонтали;
			//КонецЕсли;
			
			Если НастройкиОтображенияУзла.Свойство("ТолщинаЛинии") Тогда
				МассивСвойстваУзла.Добавить(СтрШаблон("""borderWidth"": %1", Формат(НастройкиОтображенияУзла.ТолщинаЛинии, "ЧН=0; ЧГ=0")));
			КонецЕсли;
			
			Если НастройкиОтображенияУзла.Свойство("Форма") Тогда
				МассивСвойстваУзла.Добавить(СтрШаблон("""shape"": ""%1""", НастройкиОтображенияУзла.Форма));
			КонецЕсли
			
		КонецЕсли;
		
		Если ЭтотОбъект.БлокировкаПоГоризонтали = Истина ИЛИ ЭтотОбъект.БлокировкаПоВертикали = Истина Тогда
			МассивСвойстваУзла.Добавить(СтрШаблон("""fixed"": {""x"": %1, ""y"": %2}", Формат(ЭтотОбъект.БлокировкаПоГоризонтали, "БЛ=false; БИ=true"), Формат(ЭтотОбъект.БлокировкаПоВертикали, "БЛ=false; БИ=true")));
		КонецЕсли;
		
		Массивnodes.Добавить(СтрШаблон("{%1}", СтрСоединить(МассивСвойстваУзла, "," + Символы.ПС + Символы.Таб + Символы.Таб + Символы.Таб)));
        
	КонецЦикла;
	
	
	ШаблонОсновныеСвойстваРебра = "			""id"": ""%1"",
		|			""label"": ""%2"", 
		|			""from"": ""%3"", 
		|			""to"": ""%4"",
		|			""URL"": ""%5""";
	//arrows: 'to', 
	СтатичныеСвойстваРебра = "		
		|			""length"": 200, 
		|			""width"": 3 
		//|			""smooth"": {
		//|				""enabled"": false,
		//|				""type"": ""dynamic""
		//,roundness: 0.5
		//|				}
		|";
	
	//ШаблонРебра = "
	//	|	{	id: '%1',
	//	|		label: '%2', 
	//	|		%3 
	//	|		from: '%4', 
	//	|		to: '%5',
	//	|		URL: '%6',
	//	|		arrows: 'to', 
	//	|		length: 400, 
	//	|		width: 3, 
	//	|		smooth: {
	//	|			enabled: true,
	//	|			type: 'dynamic',
	//	//|			roundness: 0.5
	//	|			}, 
	//	|		color: 
	//	|			{color: '#000000',
	//	|			highlight: 'BLUE'
	//	|			},
	//	|		font: {align: 'bottom', size: 20},
	//	|		}";
		
	Для каждого Ребро Из Ребра Цикл
	    		
		Имя 		= СтрЗаменить(Ребро.Имя, Символы.ПС, "\n");
		
		МассивСвойстваРебра = Новый Массив;
		
		МассивСвойстваРебра.Добавить(СтрШаблон(ШаблонОсновныеСвойстваРебра, Ребро.Идентификатор, Имя, Ребро.ИдентификаторНачало, Ребро.ИдентификаторКонец,  Ребро.НавигационнаяСсылка));

		Если ЗначениеЗаполнено(Ребро.Заголовок) Тогда
			МассивСвойстваРебра.Добавить(СтрШаблон("""title"": ""<pre>%1<pre>""", ОбработатьСтрокуДляHTML(Ребро.Заголовок)));
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(Ребро.ПолныйЗаголовок) Тогда //Всплывает при наведении курсора
			МассивСвойстваРебра.Добавить(СтрШаблон("""fulltitle"": ""%1""", ОбработатьСтрокуДляHTML(Ребро.ПолныйЗаголовок)));
		КонецЕсли;
	
		МассивСвойстваРебра.Добавить(СтатичныеСвойстваРебра);

		НастройкиОтображенияРебра = Неопределено;
		Если Ребро.Свойство("НастройкиОтображения", НастройкиОтображенияРебра) Тогда
					
		//	|			font: {color: '#000000', size: 20},		
			СвойстваШрифта = Неопределено;
			Если НастройкиОтображенияРебра.Свойство("СвойстваШрифта", СвойстваШрифта) Тогда
				МассивСвойстваШрифта = Новый Массив;
				
				Если СвойстваШрифта.Свойство("Размер") Тогда
					МассивСвойстваШрифта.Добавить(СтрШаблон("""size"": %1", Формат(СвойстваШрифта.Размер, "ЧН=0; ЧГ=0")))					
				КонецЕсли;
				
				Если СвойстваШрифта.Свойство("Цвет") Тогда
					МассивСвойстваШрифта.Добавить(СтрШаблон("""color"": ""%1""", СвойстваШрифта.Цвет));
				КонецЕсли;	
				
				МассивСвойстваРебра.Добавить(СтрШаблон("""font"": {%1}", СтрСоединить(МассивСвойстваШрифта, ",")));
			КонецЕсли;
			
		//	|			color: {
		//|					background: 'red',
		//|					border: '#000000',
		//|					highlight: { border: 'BLUE'	}
		//|					},
		    СвойстваЦвета = Неопределено; 
			Если НастройкиОтображенияРебра.Свойство("СвойстваЦвета", СвойстваЦвета) Тогда
				МассивСвойстваЦвета = Новый Массив;
				
				Если СвойстваЦвета.Свойство("ЦветВыделения") Тогда
					МассивСвойстваЦвета.Добавить(СтрШаблон("""highlight"": ""%1""", СвойстваЦвета.ЦветВыделения));
				КонецЕсли;
				
				Если СвойстваЦвета.Свойство("ЦветНаведения") Тогда
					МассивСвойстваЦвета.Добавить(СтрШаблон("""hover"": ""%1""", СвойстваЦвета.ЦветНаведения));
				КонецЕсли;
				
				Если СвойстваЦвета.Свойство("Цвет") Тогда
					МассивСвойстваЦвета.Добавить(СтрШаблон("""color"": ""%1""", СвойстваЦвета.Цвет));
				КонецЕсли;	
								
				МассивСвойстваРебра.Добавить(СтрШаблон("""color"": {%1}", СтрСоединить(МассивСвойстваЦвета, ",")));
			КонецЕсли;			
			ВидСтрелки = Неопределено;
			Если НастройкиОтображенияРебра.Свойство("ВидСтрелки", ВидСтрелки) Тогда
				МассивСвойстваРебра.Добавить(СтрШаблон("""arrows"": ""%1""", ВидСтрелки));							
			Иначе
				НастройкиСтрелок = Неопределено;	
				Если НастройкиОтображенияРебра.Свойство("НастройкиСтрелок", НастройкиСтрелок) Тогда
					МассивНастройкиСтрелок = Новый Массив;
					СформироватьНастройкуСтрелки("Входящая", 	МассивНастройкиСтрелок, НастройкиСтрелок);
					СформироватьНастройкуСтрелки("Исходящая", 	МассивНастройкиСтрелок, НастройкиСтрелок);
                    
					МассивСвойстваРебра.Добавить(СтрШаблон("""arrows"": {%1}", СтрСоединить(МассивНастройкиСтрелок, ",")));							
				КонецЕсли;
			КонецЕсли;
			
			
			
		КонецЕсли;
		
		Если ЭтотОбъект.ПлавныеРебра Тогда
			МассивСвойстваРебра.Добавить("""smooth"": {
			|				""enabled"": true,
			|				""type"": ""dynamic""
			//,roundness: 0.5
			|				}");
			
		Иначе
			МассивСвойстваРебра.Добавить("""smooth"": {
			|				""enabled"": false}");
			
		КонецЕсли;
        
		Массивedges.Добавить(СтрШаблон("{%1}", СтрСоединить(МассивСвойстваРебра, "," + Символы.ПС + Символы.Таб + Символы.Таб + Символы.Таб)));
		
	КонецЦикла;
	
	МассивКластеров = Новый Массив;
	ШаблонКластера = "clusterNodes('%1', [%2], '%3', %4, '%5', %6, %7, %8);	";
	
	//Если БлокировкаПоГоризонтали = Истина ИЛИ БлокировкаПоВертикали = Истина Тогда
	//	МассивСвойстваУзла.Добавить(СтрШаблон("fixed: {x: %1, y: %2}", Формат(БлокировкаПоГоризонтали, "БЛ=false; БИ=true"), Формат(БлокировкаПоВертикали, "БЛ=false; БИ=true")));
	//КонецЕсли;
		
	
	Для каждого Кластер Из Кластеры Цикл
		
		ИдентификаторКластера 	= Кластер.Идентификатор;
		ЗаголовокКластера		= "\n\n\n" + Кластер.Заголовок;
		ЗаголовокРебраКластера 	= Кластер.ЗаголовокРебра;
				
		МассивТекстВходящихИдентификаторов = Новый Массив;
		Для каждого ВходящийИдентификатор Из Кластер.ВходящиеИдентификаторы Цикл
			МассивТекстВходящихИдентификаторов.Добавить(СтрШаблон("'%1'", ВходящийИдентификатор));	
		КонецЦикла;
		ТекстВходящихИдентификаторов = СтрСоединить(МассивТекстВходящихИдентификаторов, ",");
		
		РазмерШрифта = 15;
		ТолщинаРебра = 5;
		
		Если Кластер.Свойство("X") Тогда
			X = Формат(Кластер.X, "ЧН=0; ЧГ=0");	
		Иначе
			X = 0;			
		КонецЕсли;
		
		Если Кластер.Свойство("Y") Тогда
			Y = Формат(Кластер.Y, "ЧН=0; ЧГ=0");
		Иначе
			Y = 0;
		КонецЕсли;
		
		МассивКластеров.Добавить(СтрШаблон(ШаблонКластера,ИдентификаторКластера,ТекстВходящихИдентификаторов, ЗаголовокКластера, РазмерШрифта, ЗаголовокРебраКластера, ТолщинаРебра, X, Y));
		
		
	
	//clusterNodes('cluster_UNION_T3_T5', ['SELECT_T3_T4','SELECT_T5_T6','UNION_T3_T5'], '\n\n\nОбъединение\n2 пакета', 15, 'Вложенный запрос', 5);	
	//clusterNodes('cluster_SELECT_T2', ['cluster_UNION_T3_T5','SELECT_T2'], '\n\n\nSELECT_T2', 15, 'Вложенный запрос', 5);	
	////clusterNodes('cluster_Monitoring62', ['CREATE_Monitoring62','INSERT_Monitoring62', 'SELECT_T1','SELECT_T2','UNION_T3_T5','SELECT_T3_T4','SELECT_T5_T6'], 'Временная таблица Monitoring62', 15, '', 5);	
	//clusterNodes('cluster_Monitoring62', ['CREATE_Monitoring62','INSERT_Monitoring62', 'SELECT_T1','cluster_SELECT_T2'], '\n\n\n\nВременная таблица \nMonitoring62\n6 узлов', 25, '', 5);	
		
	КонецЦикла;
	
	
	Блокnodes = СтрШаблон("[%1]", СтрСоединить(Массивnodes, "," + Символы.ПС));  
	Блокedges = СтрШаблон("[%1]", СтрСоединить(Массивedges, "," + Символы.ПС));  
	
	//Блокnodes = ПеременнаяDataset("nodes", Массивnodes);
	//Блокedges = ПеременнаяDataset("edges", Массивedges);
	
	ТекстКластеры = СтрСоединить(МассивКластеров, Символы.ПС + Символы.Таб + Символы.Таб);
	
	Шаблонoptions = "
		|	 nodes: {
		|      shape: 'box',
		|      color: {
		|          background: 'white',
		|          border: 'black',
		|      },
		|      borderWidth: 1,
		|       font: { 
		|        multi: 'html'
		|      }
		|    },
		|    edges: {color: {color: '#000000', highlight: 'BLUE'},}
		|,
		|    layout: {
		|      //randomSeed: undefined,
		|      improvedLayout: true,
		|      //hierarchical: {
		|      //  direction: 'UD',
		|      //  sortMethod: 'directed',
		|      //  shakeTowards: 'nodes',
		|      //  nodeSpacing: 180,
		|     //   levelSeparation: 80,
		|      //  treeSpacing: 180,
		|      //  edgeMinimization: true,
		|     //   blockShifting: true
		|     // }
		|      
		|    },
		//|    manipulation: {
		//|        enabled: false,
		//|        initiallyActive: false,
		//|        addNode: true,
		//|        addEdge: function(edgeData, callback) {
		//|          if (edgeData.from !== edgeData.to) {
		//|            edgeData.arrows = 'to';
		//|            callback(edgeData);
		//|          }
		//|        },
		//|        editNode: true,
		//|        editEdge: true,
		//|        deleteNode: true,
		//|        deleteEdge: true,
		//|        controlNodeStyle:{
		//|          // all node options are valid.
		//|        }
		//|    },
		|    interaction: { 
		|      hover: true,
		|      navigationButtons: true, 
		|      dragNodes: true,
		|      keyboard: true,
		|      multiselect: true
		|    },
		|    physics: {
		|      enabled: %1,
		|      //maxVelocity: 0,
		|      //maxVelocity: 0,
		|      timestep: 0.5,
		|      adaptiveTimestep: true,
		|      barnesHut: {
		|          theta: 0.5,
		|          gravitationalConstant: -25000,//-3000,
		|          centralGravity: 0.3,
		|          springLength: 195,//95,
		|          springConstant: 0.002,
		|          damping: 0.09,
		|          avoidOverlap: 0
		|      },
		//|      forceAtlas2Based: {
		//|          theta: 0.5,
		//|          gravitationalConstant: -120,
		//|          centralGravity: 0.01,
		//|          springConstant: 0.08,
		//|          springLength: 50,
		//|          damping: 0.4,
		//|          avoidOverlap: 0
		//|      },
		//|      repulsion: {
		//|          centralGravity: 0.2,
		//|          springLength: 200,
		//|          springConstant: 0.05,
		//|          nodeDistance: 200,
		//|          damping: 0.09
		//|      },
		//|      hierarchicalRepulsion: {
		//|          centralGravity: 0.05,
		//|          springLength: 100,
		//|          springConstant: 0.01,
		//|          nodeDistance: 140,
		//|          damping: 0.2,
		//|          avoidOverlap: 0.1
		//|      },
		|      solver: 'barnesHut',//'forceAtlas2Based',
		|      stabilization: {
		|          enabled: true,
		|          iterations: 1000,
		|          updateInterval: 150,
		|          onlyDynamicEdges: false,
		|          fit: false
		|       },
		|    },
		//|    groups: {
		//|      myGroup: {
		//|        borderWidth:3
		//|      }
		//|    },
		|    smoothCurves: true,
		|    freezeForStabilization: false
		|  ";

	//!!!ФизикаТекст = ?(НастройкиОтображения.Свойство("Физика") и НастройкиОтображения.Физика, "true", "false");
	ФизикаТекст = ?(ЭтотОбъект.Физика, "true", "false");
	
	
	Строкаoptions = СтрШаблон(Шаблонoptions, ФизикаТекст);
  	
	head 		= Шаблон_head("Схема запроса");

	css 		= Шаблон_css();
	
	div 		= Шаблон_div(ИдентификаторСхемы);	
	
	variables 	= Шаблон_variables();
	
	
	network 	= Шаблон_network(ИдентификаторСхемы, Блокnodes, Блокedges, Строкаoptions, ТекстКластеры);	
	
	functions 	= Шаблон_functions();
	
	ПолныйТекстHTML = СформироватьHTMLПоБлокам(head, css, div, variables, network, functions, Отладка);	
	
	Возврат Новый Структура("HTML, nodes, edges", ПолныйТекстHTML,Блокnodes, Блокedges);;
		
КонецФункции

Функция ОбработатьСтрокуДляHTML(Строка)

	Строка = СтрЗаменить(Строка,Символы.ПС, "<br>");
	Строка = СтрЗаменить(Строка, """","\""");
	Строка = СтрЗаменить(Строка, Символы.Таб,"    " ); 
    Возврат Строка;
	
КонецФункции // ()


Процедура СформироватьНастройкуСтрелки(ВидСтрелки, МассивНастройкиСтрелок, НастройкиСтрелок)
	
	
	ВидСтрелкиJS = ?(ВидСтрелки = "Входящая","""to""", """from""");
	НастройкаСтрелки = Неопределено;
	Если НастройкиСтрелок.Свойство(ВидСтрелки, НастройкаСтрелки) Тогда
		Если ТипЗнч(НастройкаСтрелки) = Тип("Строка") Тогда
			МассивНастройкиСтрелок.Добавить(СтрШаблон("%1: {""enabled"": true, ""type"": ""%2""}", ВидСтрелкиJS, НастройкаСтрелки));
		Иначе
			Дополнение = "";							
			Если НастройкаСтрелки.Тип = "image" Тогда
				Дополнение = СтрШаблон(", ""imageHeight"":%1, ""imageWidth"":%2, ""src"":""%3""",Формат(НастройкаСтрелки.ВысотаКартинки, "ЧН=0; ЧГ=0"), Формат(НастройкаСтрелки.ШиринаКартинки, "ЧН=0; ЧГ=0"), СтрЗаменить(НастройкаСтрелки.Источник,"""","\""") );
				
			КонецЕсли;
			МассивНастройкиСтрелок.Добавить(СтрШаблон("%1: {""enabled"": true, ""type"": ""%2"" %3}", ВидСтрелкиJS, НастройкаСтрелки.Тип, Дополнение));	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция СформироватьHTMLПоБлокам(head, css, div, variables, network, functions, Отладка = Ложь)
	
	СтрокиHTMLДокумента = Новый Массив;
	
	//html
	СтрокиHTMLДокумента.Добавить("<html>");
	
	//	head
	СтрокиHTMLДокумента.Добавить("	<head>");
	СтрокиHTMLДокумента.Добавить(head);
	СтрокиHTMLДокумента.Добавить("	</head>");
	
	//	------------
	//body
	СтрокиHTMLДокумента.Добавить("	<body>");
	
	//СтрокиHTMLДокумента.Добавить("	<style>");
	//СтрокиHTMLДокумента.Добавить(css);
	//СтрокиHTMLДокумента.Добавить("	</style>");
	
	СтрокиHTMLДокумента.Добавить(div);
		
	//	script
	СтрокиHTMLДокумента.Добавить("		<script type='text/javascript'>");
	
	Если Отладка Тогда
		СтрокиHTMLДокумента.Добавить("		 try { ");
	КонецЕсли;
	
	СтрокиHTMLДокумента.Добавить(variables);	
	
    СтрокиHTMLДокумента.Добавить(network);
	
	//СтрокиHTMLДокумента.Добавить(ОбработчикиПослеФормирования);
	
	СтрокиHTMLДокумента.Добавить(functions);
	
	Если Отладка Тогда
		СтрокиHTMLДокумента.Добавить("		} catch (e) {	alert(e); } ");
	КонецЕсли;
	
	СтрокиHTMLДокумента.Добавить("		</script>");
	СтрокиHTMLДокумента.Добавить("	</body>");
	СтрокиHTMLДокумента.Добавить("</html>");
	
	Возврат СтрСоединить(СтрокиHTMLДокумента, Символы.ПС);

КонецФункции

Функция Шаблон_head(Заголовок = "Схема запроса")
	
	СтрокиHTMLДокумента = Новый Массив;
	СтрокиHTMLДокумента.Добавить(СтрШаблон("<title>%1</title>", Заголовок));
	
	ТекстБиблиотеки = ЭтотОбъект.ПолучитьМакет("БиблиотекаВизуализацииVisjs").ПолучитьТекст();
	
	СтрокиHTMLДокумента.Добавить(СтрШаблон("<script >%1</script>", ТекстБиблиотеки));
	
	СтрокиHTMLДокумента.Добавить("<meta charset=""UTF-8"">
		|	<meta name=""viewport""
		|	      content=""width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0"">
		|	<meta http-equiv=""X-UA-Compatible"" content=""ie=edge"">");	
	  		
	Возврат СтрСоединить(СтрокиHTMLДокумента, Символы.ПС);
	
КонецФункции

Функция Шаблон_css()
	МассивТекст = Новый Массив;
		
	Возврат СтрСоединить(МассивТекст, Символы.ПС);
КонецФункции

Функция Шаблон_div(Идентификатор = "mynetwork")
	
	СтрокиHTMLДокумента = Новый Массив;
	СтрокиHTMLДокумента.Добавить(СтрШаблон("		<div id=""%1""></div>", Идентификатор ));	
	
	Возврат СтрСоединить(СтрокиHTMLДокумента, Символы.ПС);
	
КонецФункции

Функция Шаблон_variables()
	
	СтрокиHTMLДокумента = Новый Массив;     
	//
	СтрокиHTMLДокумента.Добавить("		var EventName = null; ");
	СтрокиHTMLДокумента.Добавить("		var EventDescription = null; ");
	СтрокиHTMLДокумента.Добавить("		var network = null; ");
	СтрокиHTMLДокумента.Добавить("		var nodes = null; ");
	СтрокиHTMLДокумента.Добавить("		var edges = null; ");
	
  	
	Возврат СтрСоединить(СтрокиHTMLДокумента, Символы.ПС);
	
КонецФункции

Функция Шаблон_network(Идентификатор = "mynetwork",Блокnodes, Блокedges, Строкаoptions, ТекстКластеры)
	
	СтрокиHTMLДокумента = Новый Массив;
	
	СтрокиHTMLДокумента.Добавить("function draw_query_diagram(nodes_js, edges_js) {
	  |		try {"); // alert(nodes_js);
	          
		//network.stabilize(100);
		
	
	СтрокиHTMLДокумента.Добавить(СтрШаблон(
	"		var ID = '%1';
	|		// create a network
	|		var container%1 = document.getElementById('%1');", Идентификатор));
	
	СтрокиHTMLДокумента.Добавить(" nodes = new vis.DataSet(JSON.parse(nodes_js));");
	СтрокиHTMLДокумента.Добавить(" edges = new vis.DataSet(JSON.parse(edges_js));");
		
	СтрокиHTMLДокумента.Добавить("		var data = {
    |		nodes: nodes,
    |		edges: edges
  	|		};");
	
	СтрокиHTMLДокумента.Добавить(СтрШаблон(
	"		var options = {
	|			%1
	|			};",  Строкаoptions));

	СтрокиHTMLДокумента.Добавить(СтрШаблон(
	"		network = new vis.Network(container%1, data, options);", Идентификатор));
	
	ВызовМасштабирования = ?(ЭтотОбъект.МасштабироватьПриРаскрытииКластера, "setTimeout(() => { network.fit() }, 70)","");
	
	ВызовСтабилизации = ?(ЭтотОбъект.Стабилизация, "network.stabilize(400);","");
	
	//События нажатия
	СтрокиHTMLДокумента.Добавить(СтрШаблон("
	    |		network.on(""doubleClick"", function (params) {
  		|			EventName = 'ДвойноеНажатие';
  		|			EventDescription = JSON.stringify(
		|				params,
    	|				null,
	    |				4,
  		|				);
        |			}); 
    	|        		
		|        network.on(""click"", function (params) {
    	|        if (params.nodes.length == 1) {
    	|              if (network.isCluster(params.nodes[0]) == true) {
    	|              NodesInCluster = network.getNodesInCluster(params.nodes[0]);
		|                network.openCluster(params.nodes[0]);
		|                %1
		| 	             network.selectNodes(NodesInCluster);
    	|              	 %2
		
    	|              }
    	|            }
    	|          });
    	|        
		|		network.on(""click"", function (params) {
		|			EventName = 'Нажатие';
		|  			EventDescription = JSON.stringify(
		|				params,
		|    			null,
		|	    		4,
		|  				);		  
		|			}); ",ВызовСтабилизации, ВызовМасштабирования));
	
	
	СтрокиHTMLДокумента.Добавить(ТекстКластеры);
	
	Если ЭтотОбъект.Стабилизация Тогда
	СтрокиHTMLДокумента.Добавить("		
		|	setTimeout(() => { network.stabilize(450) }, 200);");
	КонецЕсли;
	СтрокиHTMLДокумента.Добавить("		
		|	setTimeout(() => { network.fit() }, 400); ");

	СтрокиHTMLДокумента.Добавить("} catch (e) {	alert(e); }    
	|			};");

	Возврат СтрСоединить(СтрокиHTMLДокумента, Символы.ПС);
	
КонецФункции

Функция Шаблон_functions()
	
	
	//ВызовМасштабирования = ?(ЭтотОбъект.МасштабироватьПриРаскрытииКластера, "setTimeout(() => { network.fit() }, 70)","");
	//
	
	СтрокиHTMLДокумента = Новый Массив;
	////События нажатия
	//СтрокиHTMLДокумента.Добавить(СтрШаблон("
	//    |		network.on(""doubleClick"", function (params) {
	//  	|			EventName = 'ДвойноеНажатие';
	//  	|			EventDescription = JSON.stringify(
	//	|				params,
	//	|				null,
	//    |				4,
	//  	|				);
	//    |			}); 
	//	|        		
	//	|        network.on(""click"", function (params) {
	//	|        if (params.nodes.length == 1) {
	//	|              if (network.isCluster(params.nodes[0]) == true) {
	//	|              NodesInCluster = network.getNodesInCluster(params.nodes[0]);
	//	|                network.openCluster(params.nodes[0]);
	//	|                network.stabilize(400);
	//	| 	             network.selectNodes(NodesInCluster);
	//	|              	 %1
	//	
	//	|              }
	//	|            }
	//	|          });
	//	|        
	//	|		network.on(""click"", function (params) {
	//	|			EventName = 'Нажатие';
	//	|  			EventDescription = JSON.stringify(
	//	|				params,
	//	|    			null,
	//	|	    		4,
	//	|  				);		  
	//	|			}); ",ВызовМасштабирования));
	
	//Функции
	СтрокиHTMLДокумента.Добавить("
		|		
		|		function getNodeProperty(nodeID, propertyName) {
		|		    return nodes.get(nodeID)[propertyName];		    
		|		}
		|		
		|		function getEdgeProperty(edgeID, propertyName) {
		|		    return edges.get(edgeID)[propertyName];		    
		|		} ");
	
	
	
	СтрокиHTMLДокумента.Добавить("
		|	
		|	function clusterNodes(clusterid, nodeidarray, nodelabel, fontsize, edgelabel, edgewidth, coordx, coordy) {
		|	  try { 
		|	  var clusterOptionsByData = {
		|	  	joinCondition: function (childOptions) {
		|	   		return nodeidarray.includes(childOptions.id)
		|		},
		|	  clusterNodeProperties: {
		|	    id: clusterid, label:nodelabel,
		|	    borderWidth: 3,
		|	    shape: ""database"", x:coordx, y:coordy,
		|	    font: { size: fontsize },
		|	  },
		|	   clusterEdgeProperties: {
		|	        label: edgelabel,
		|	        width: edgewidth,
		|	        length: 350
		|	    }
		|	};
		|		network.cluster(clusterOptionsByData);        
		|		//network.stabilize(100);
		|	 	} catch (e) {	alert(e); }    
		|	};");
	
	//СтрокиHTMLДокумента.Добавить("		
	//	|	setTimeout(() => { network.stabilize(450) }, 200);
	//	|	setTimeout(() => { network.fit() }, 400); ");
	
	Возврат СтрСоединить(СтрокиHTMLДокумента, Символы.ПС);
    
КонецФункции

// Нет ссылок на функцию
Функция ПеременнаяDataset(Имя, МассивОбъектов)

	Возврат СтрШаблон("		var %1 = new vis.DataSet([%2]);", Имя, СтрСоединить(МассивОбъектов, "," + Символы.ПС));

КонецФункции // ПеременнаяDataset()

#КонецОбласти


#КонецОбласти

#КонецЕсли