///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024-2026, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КопироватьДанныеФормы(Параметры.Объект, ЭтотОбъект.Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
	Элементы.ПутьКПитону.КнопкаВыбора = ЛОЖЬ;
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Асинх Процедура ПутьКПитонуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	#Если ВебКлиент Тогда
	Возврат;
	#КонецЕсли
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок          = НСтр("ru = 'Выберите путь установленого приложения python'");
	Диалог.ПолноеИмяФайла     = Объект.ПутьКПитону;
	Диалог.Фильтр             = НСтр("ru = 'Приложение (*.exe)'")+"|*.exe|"+НСтр("ru = 'Все файлы (*.*)'")+"|*.*";
	Диалог.МножественныйВыбор = ЛОЖЬ;
	
	Ответ = Ждать Диалог.ВыбратьАсинх();
	Если Ответ=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПутьКПитону = Диалог.ПолноеИмяФайла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	
	КопироватьДанныеФормы(ЭтотОбъект.Объект, ЭтотОбъект.ВладелецФормы.Объект);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
